geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
#include "rp2350_gea_platform.h"

#include <rp2350_panel.h>

#include "app.h"
#include "audio.h"
#include "board.h"
#include "canvas.h"
#include "display.h"
#include "display_present.h"
#include "event.h"
#include "events.h"
#include "host/audio.h"
#include "host/backends.h"
#include "host/display_orientation.h"
#include "host/timers.h"
#include "input.h"
#include "memory.h"
#include "pixel.h"
#include "services/frame_scheduler.h"
#include "services/storage_service.h"
#include "touch.h"
#ifndef GEA_RP2350_HAS_TOUCH
#define GEA_RP2350_HAS_TOUCH 1
#endif
#if GEA_RP2350_HAS_TOUCH
#include "touch/ft6336/ft6336.h"
#endif
#include "ui/document.h"
#include "ui/internal.h"
#include "ui/style.h"
#include "ui/tree_internal.h"

#if __has_include("gea_embedded_app_config.h")
#include "gea_embedded_app_config.h"
#endif

#include "hardware/adc.h"
#include "hardware/gpio.h"
#include "hardware/i2c.h"
#include "hardware/sync.h"
#include "pico/bootrom.h"
#include "pico/multicore.h"
#include "pico/stdlib.h"

#include <algorithm>
#include <array>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <functional>
#include <new>
#include <string>
#include <utility>
#include <vector>

extern "C" {
#include "rp_pico_alloc.h"
}

#ifndef GEA_RP2350_HAS_BUTTONS
#define GEA_RP2350_HAS_BUTTONS 0
#endif

// Opt-in: make the hardware Up/Down buttons scroll the primary scrollable
// container by default (browser-style arrow-key page scroll). Off by default;
// enabled only by boards that want it (e.g. the touchless Tufty 2350).
#ifndef GEA_RP2350_DEFAULT_BUTTON_SCROLL
#define GEA_RP2350_DEFAULT_BUTTON_SCROLL 0
#endif

#ifndef GEA_RP2350_FRAMEBUFFER_IN_SRAM
#define GEA_RP2350_FRAMEBUFFER_IN_SRAM 0
#endif

#ifndef GEA_RP2350_BACKGROUND_CACHE_IN_SRAM
#ifdef GEA_EMBEDDED_DISPLAY_BACKGROUND_CACHE_IN_SRAM
#define GEA_RP2350_BACKGROUND_CACHE_IN_SRAM GEA_EMBEDDED_DISPLAY_BACKGROUND_CACHE_IN_SRAM
#elif defined(GEA_RP2350_DEFAULT_BACKGROUND_CACHE_IN_SRAM)
#define GEA_RP2350_BACKGROUND_CACHE_IN_SRAM GEA_RP2350_DEFAULT_BACKGROUND_CACHE_IN_SRAM
#else
#define GEA_RP2350_BACKGROUND_CACHE_IN_SRAM 0
#endif
#endif

#ifndef GEA_RP2350_DISPLAY_COMMAND_BUFFER_BYTES
#define GEA_RP2350_DISPLAY_COMMAND_BUFFER_BYTES 0
#endif

#ifndef GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS
#ifdef GEA_EMBEDDED_DISPLAY_COMMAND_BUFFER_COMMANDS
#define GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS GEA_EMBEDDED_DISPLAY_COMMAND_BUFFER_COMMANDS
#elif defined(GEA_RP2350_DEFAULT_DISPLAY_COMMAND_BUFFER_COMMANDS)
#define GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS GEA_RP2350_DEFAULT_DISPLAY_COMMAND_BUFFER_COMMANDS
#else
#define GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS 0
#endif
#endif

#ifndef GEA_RP2350_PIE_BLEND
#define GEA_RP2350_PIE_BLEND 0
#endif

#ifndef GEA_RP2350_EARLY_PSRAM_ALLOC
#define GEA_RP2350_EARLY_PSRAM_ALLOC 0
#endif

#ifndef GEA_RP2350_RENDER_CORE1
// Second M33 rasters the bottom half of each present chunk in parallel with the
// first core's top half — the present is raster-bound, not bus-bound, so this is
// the main fps lever. See rasterPresentChunk.
#define GEA_RP2350_RENDER_CORE1 1
#endif

#ifndef GEA_RP2350_RENDER_CORE1_STACK_BYTES
// Dedicated stack: the worker runs present::rasterFrameRows (local Canvas + the
// per-command raster recursion), which needs more than the 2KB pico-sdk default.
#define GEA_RP2350_RENDER_CORE1_STACK_BYTES 8192
#endif

#ifndef GEA_RP2350_RENDER_CORE1_WAIT_TIMEOUT_US
#define GEA_RP2350_RENDER_CORE1_WAIT_TIMEOUT_US 0
#endif

#ifndef GEA_RP2350_SOFTWARE_SCROLL_REGISTER
#define GEA_RP2350_SOFTWARE_SCROLL_REGISTER 1
#endif

// Use a panel's DCS vertical-scroll register (VSCRDEF/VSCSAD) for full-screen
// vertical scrolls: the framebuffer keeps its circular row layout, GRAM mirrors
// it 1:1, and the panel applies the display-order rotation itself — so a scroll
// frame only streams the revealed strip (plus scrollbar/slot damage) instead of
// re-streaming the whole region. Requires GEA_RP2350_SOFTWARE_SCROLL_REGISTER.
// ⚠ MUST STAY OFF for the Waveshare 2.41 RM690B0: this panel IGNORES
// VSCRDEF/VSCSAD (verified 2026-07-02 — the display shows stale content while
// fps soars because nothing streams). That's exactly why the software scroll
// register exists. Only enable on a panel proven to honor 0x33/0x37.
#ifndef GEA_RP2350_PANEL_HW_VSCROLL
#define GEA_RP2350_PANEL_HW_VSCROLL 0
#endif

namespace gea::framework::app::generated {
void drainMicrotasks();
}  // namespace gea::framework::app::generated

namespace {

namespace board = gea::platform::board;
constexpr std::uint32_t kAllocMagic = 0x47454152u;

i2c_inst_t *boardI2c()
{
	return board::i2c.bus == 1 ? i2c1 : i2c0;
}

struct AllocHeader {
	std::uint32_t magic = kAllocMagic;
	std::uint32_t flags = 0;
	std::size_t size = 0;
	std::size_t alignment = 0;
	void *raw = nullptr;
};

bool gUseRpAllocator = false;

struct PoolAllocationStats {
	std::uint32_t allocCount = 0;
	std::uint32_t freeCount = 0;
	std::size_t liveBytes = 0;
	std::size_t peakBytes = 0;
};

PoolAllocationStats gSramAllocStats;
PoolAllocationStats gPsramAllocStats;

PoolAllocationStats &poolStats(bool rp)
{
	return rp ? gPsramAllocStats : gSramAllocStats;
}

void noteAllocation(bool rp, std::size_t size)
{
	auto &stats = poolStats(rp);
	stats.allocCount++;
	stats.liveBytes += size;
	if (stats.liveBytes > stats.peakBytes) stats.peakBytes = stats.liveBytes;
}

void noteFree(bool rp, std::size_t size)
{
	auto &stats = poolStats(rp);
	stats.freeCount++;
	stats.liveBytes = size <= stats.liveBytes ? stats.liveBytes - size : 0;
}

struct RawAllocation {
	void *ptr = nullptr;
	bool rp = false;
};

RawAllocation rawAlloc(std::size_t size)
{
	if (gUseRpAllocator) {
		if (void *ptr = rp_mem_malloc(size)) return {ptr, true};
	}
#if GEA_RP2350_EARLY_PSRAM_ALLOC
	if (void *ptr = rp_mem_malloc(size)) return {ptr, true};
#endif
	return {std::malloc(size), false};
}

void rawFree(void *ptr, bool rp)
{
	if (!ptr) return;
	if (rp) rp_mem_free(ptr);
	else std::free(ptr);
}

void *allocBlock(std::size_t size, std::size_t alignment)
{
	if (size == 0) size = 1;
	if (alignment < alignof(void *)) alignment = alignof(void *);
	const std::size_t total = size + alignment - 1 + sizeof(AllocHeader);
	RawAllocation raw = rawAlloc(total);
	if (!raw.ptr) {
		reset_usb_boot(0, 0);
		std::abort();
	}
	const auto base = reinterpret_cast<std::uintptr_t>(raw.ptr) + sizeof(AllocHeader);
	const auto aligned = (base + alignment - 1) & ~(static_cast<std::uintptr_t>(alignment) - 1);
	auto *header = reinterpret_cast<AllocHeader *>(aligned - sizeof(AllocHeader));
	header->magic = kAllocMagic;
	header->flags = raw.rp ? 1u : 0u;
	header->size = size;
	header->alignment = alignment;
	header->raw = raw.ptr;
	noteAllocation(raw.rp, size);
	return reinterpret_cast<void *>(aligned);
}

AllocHeader *headerFor(void *ptr)
{
	if (!ptr) return nullptr;
	auto *header = reinterpret_cast<AllocHeader *>(reinterpret_cast<std::uintptr_t>(ptr) - sizeof(AllocHeader));
	return header->magic == kAllocMagic ? header : nullptr;
}

void freeBlock(void *ptr) noexcept
{
	if (!ptr) return;
	AllocHeader *header = headerFor(ptr);
	if (!header) {
		std::free(ptr);
		return;
	}
	void *raw = header->raw;
	const bool rp = (header->flags & 1u) != 0;
	const std::size_t size = header->size;
	header->magic = 0;
	noteFree(rp, size);
	rawFree(raw, rp);
}

