geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
void *reallocBlock(void *ptr, std::size_t size)
{
	if (!ptr) return allocBlock(size, alignof(std::max_align_t));
	AllocHeader *header = headerFor(ptr);
	if (!header) return std::realloc(ptr, size);
	void *next = allocBlock(size, header->alignment);
	std::memcpy(next, ptr, std::min(size, header->size));
	freeBlock(ptr);
	return next;
}

using Pixel = gea::framework::graphics::pixel::native_t;
namespace present = gea::framework::display_present;
gea::framework::graphics::Canvas gDisplayCanvas;
#if GEA_RP2350_RENDER_CORE1
gea::framework::graphics::Canvas gRenderWorkerCanvas;
#endif
#if GEA_RP2350_FRAMEBUFFER_IN_SRAM
alignas(4) Pixel gSramFramebuffer[gea::rp2350::kPanelWidth * gea::rp2350::kPanelHeight]
    __attribute__((section(".uninitialized_data")));
#endif
#if GEA_RP2350_BACKGROUND_CACHE_IN_SRAM
alignas(4) Pixel gSramBackgroundCache[gea::rp2350::kPanelWidth * gea::rp2350::kPanelHeight]
    __attribute__((section(".uninitialized_data")));
#endif
#if GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS > 0
alignas(gea::embedded::ui::DisplayCommand) gea::embedded::ui::DisplayCommand
    gSramDisplayCommandBuffer[GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS]
    __attribute__((section(".uninitialized_data")));
#elif GEA_RP2350_DISPLAY_COMMAND_BUFFER_BYTES > 0
alignas(16) std::uint8_t gSramDisplayCommandBuffer[GEA_RP2350_DISPLAY_COMMAND_BUFFER_BYTES]
    __attribute__((section(".uninitialized_data")));
#endif
Pixel *gFramebuffer = nullptr;
std::uint8_t gDisplayAlpha = 255;
int gFlushRows = 64;
int gFlushDepth = 2;
int gFrameIntervalMs = gea::framework::services::FrameScheduler::kDefaultFrameIntervalMs;
int gFlushCalls = 0;
int gFlushPixels = 0;
int gBrightness = 100;
bool gVsyncDriven = false;
bool gInvalidated = true;
present::Frame gPreviousPresentFrame;
bool gPreviousPresentValid = false;
// Present render-scale (1 = native, 2 = app renders a half-panel viewport and the
// present 2x-upscales each chunk). gea3d opts in via Display::setPresentScale(2)
// when it renders into a width/2 x height/2 viewport — half the fill/overdraw,
// full-res out. Matches the ESP32 backend's presentScale_ behaviour.
int gPresentScale = 1;
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
int gScrollRegionY = 0;
int gScrollRegionH = 0;
int gScrollOffsetY = 0;
#endif

#if GEA_RP2350_RENDER_CORE1
struct RenderWorkerTask {
	void (*fn)(void *, int, int) = nullptr;
	void *ctx = nullptr;
	int y0 = 0;
	int y1 = -1;
};

constexpr std::uint32_t kRenderWorkerRun = 0x47455231u;   // "GER1"
constexpr std::uint32_t kRenderWorkerDone = 0x47455244u;  // "GERD"
RenderWorkerTask gRenderWorkerTask;
volatile bool gRenderWorkerReady = false;
volatile bool gRenderWorkerInFlight = false;
#if GEA_RP2350_RENDER_CORE1_STACK_BYTES > 0
static_assert((GEA_RP2350_RENDER_CORE1_STACK_BYTES % sizeof(std::uint32_t)) == 0,
              "Core1 render stack size must be a multiple of 4 bytes");
alignas(8) std::uint32_t gRenderWorkerStack[GEA_RP2350_RENDER_CORE1_STACK_BYTES / sizeof(std::uint32_t)]
    __attribute__((section(".uninitialized_data")));
#endif
#endif

bool onRenderWorkerCore()
{
#if GEA_RP2350_RENDER_CORE1
	return get_core_num() == 1;
#else
	return false;
#endif
}

gea::framework::graphics::Canvas &activeDisplayCanvas()
{
#if GEA_RP2350_RENDER_CORE1
	if (onRenderWorkerCore()) return gRenderWorkerCanvas;
#endif
	return gDisplayCanvas;
}

#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
void setScrollRegionAll(int regionY, int regionH, int scrollOffsetY)
{
	gScrollRegionY = regionY;
	gScrollRegionH = regionH;
	gScrollOffsetY = scrollOffsetY;
	gDisplayCanvas.setScrollRegion(regionY, regionH, scrollOffsetY);
#if GEA_RP2350_RENDER_CORE1
	gRenderWorkerCanvas.setScrollRegion(regionY, regionH, scrollOffsetY);
#endif
#if GEA_RP2350_PANEL_HW_VSCROLL
	// Full-screen regions ride the panel's scroll register; partial-height
	// regions keep VSCSAD at identity and flush through the software remap.
	if (regionH > 0 && regionY == 0 && regionH == gea::rp2350::kPanelHeight) {
		gea::rp2350::panelSetVerticalScroll(scrollOffsetY);
	} else {
		gea::rp2350::panelSetVerticalScroll(0);
	}
#endif
}
#endif

#if GEA_RP2350_RENDER_CORE1
void bindRenderWorkerCanvas()
{
	if (gFramebuffer) {
		gRenderWorkerCanvas.bindPixels(gFramebuffer, gea::rp2350::kPanelWidth, gea::rp2350::kPanelHeight);
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
		gRenderWorkerCanvas.setScrollRegion(gScrollRegionY, gScrollRegionH, gScrollOffsetY);
#endif
		gRenderWorkerCanvas.resetDirty();
		gRenderWorkerCanvas.resetClip();
		gRenderWorkerCanvas.setGlobalAlpha(255);
	}
}

void renderWorkerMain()
{
	bindRenderWorkerCanvas();
	__dmb();
	gRenderWorkerReady = true;
	while (true) {
		const std::uint32_t cmd = multicore_fifo_pop_blocking();
		if (cmd != kRenderWorkerRun) continue;
		__dmb();
		bindRenderWorkerCanvas();
		RenderWorkerTask task = gRenderWorkerTask;
		if (task.fn && task.y0 <= task.y1) {
			task.fn(task.ctx, task.y0, task.y1);
		}
		__dmb();
		multicore_fifo_push_blocking(kRenderWorkerDone);
	}
}

void startRenderWorker()
{
	static bool launched = false;
	if (launched) return;
	launched = true;
#if GEA_RP2350_RENDER_CORE1_STACK_BYTES > 0
	multicore_launch_core1_with_stack(renderWorkerMain, gRenderWorkerStack, sizeof(gRenderWorkerStack));
#else
	multicore_launch_core1(renderWorkerMain);
#endif
	for (int i = 0; i < 200000 && !gRenderWorkerReady; ++i) {
		tight_loop_contents();
	}
}
#endif

struct FlushWindow {
	int x0 = 0;
	int y0 = 0;
	int x1 = 0;
	int y1 = 0;
};

constexpr int kMaxCollectedWindows = 64;
constexpr int kWindowMergeGapShift = 2;
constexpr int kDenseWindowMergeThresholdPercent = 75;

struct ScheduledTimer {
	double id = 0;
	gea::host::TimerCallback callback;
	double delayMs = 0;
	double nextFireMs = 0;
	bool interval = false;
	bool active = false;
};

std::array<ScheduledTimer, 16> gTimers{};
std::array<gea::host::AnimationFrameCallback, 16> gPendingRaf{};
std::array<gea::host::AnimationFrameCallback, 16> gActiveRaf{};
int gPendingRafCount = 0;
double gNextTimerId = 1;
double gLastTimestampMs = 0;

std::array<gea::framework::events::Event, gea::framework::services::FrameScheduler::kEventQueueDepth> gEvents{};
int gEventHead = 0;
int gEventTail = 0;
bool gEventQueueStarted = false;

#if GEA_RP2350_HAS_BUTTONS
std::array<bool, board::buttons.size()> gButtonDown{};
// Next time (µs since boot) a held auto-repeat button re-fires its keydown.
std::array<std::uint64_t, board::buttons.size()> gButtonNextRepeatUs{};

void dispatchKeyInput()
{
	auto &tree = gea::embedded::ui::Tree::instance();
	for (int keyCode = gea::framework::input::consumeKeyDown(); keyCode != 0;
	     keyCode = gea::framework::input::consumeKeyDown()) {
		gea::framework::events::PointerEvent event{};
		event.type = gea::framework::events::PointerEventType::KeyDown;
		event.keyCode = keyCode;
		event.bubbles = true;
		event.cancelable = true;

