geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
		const int inputId = tree.activeInputId();
		bool stopped = false;
		if (inputId >= 0) {
			event.targetId = inputId;
			event.currentTargetId = inputId;
			tree.dispatchEvent(event);
			stopped = event.propagationStopped;
		}
		if (!stopped) {
			event.propagationStopped = false;
			gea::embedded::ui::dispatchDocumentKeyDown(event);
		}

#if GEA_RP2350_DEFAULT_BUTTON_SCROLL
		// Default action for the hardware Up/Down buttons on this touchless
		// board: scroll the primary scrollable container, mirroring a browser's
		// arrow-key page scroll. Skipped when a text input is focused (arrows
		// move the caret there) or the app consumed the key via
		// preventDefault().
		constexpr int kKeyCodeArrowUp = 38;    // web keyCode for ArrowUp
		constexpr int kKeyCodeArrowDown = 40;  // web keyCode for ArrowDown
		constexpr int kButtonScrollStepPx = 12;
		if (inputId < 0 && !event.defaultPrevented) {
			if (keyCode == kKeyCodeArrowDown) {
				tree.scrollByKeyStep(kButtonScrollStepPx);
			} else if (keyCode == kKeyCodeArrowUp) {
				tree.scrollByKeyStep(-kButtonScrollStepPx);
			}
		}
#endif
	}
}
#endif

#if GEA_RP2350_HAS_TOUCH
class Ft6336Bus final : public gea::chips::ft6336::RegisterBus {
public:
	bool writeRegister(std::uint8_t reg, std::uint8_t value) override
	{
		const std::uint8_t data[2] = {reg, value};
		return i2c_write_blocking(boardI2c(), board::touch.address, data, 2, false) == 2;
	}

	bool readRegister(std::uint8_t reg, std::uint8_t &value) override
	{
		if (i2c_write_blocking(boardI2c(), board::touch.address, &reg, 1, true) != 1) return false;
		return i2c_read_blocking(boardI2c(), board::touch.address, &value, 1, false) == 1;
	}

	bool readRegisters(std::uint8_t reg, std::uint8_t *data, std::size_t length) override
	{
		if (!data || length == 0) return false;
		if (i2c_write_blocking(boardI2c(), board::touch.address, &reg, 1, true) != 1) return false;
		return i2c_read_blocking(boardI2c(), board::touch.address, data, length, false) ==
		       static_cast<int>(length);
	}
};

Ft6336Bus gTouchBus;
gea::chips::ft6336::ControllerCore gTouchCore;
gea::platform::touch::Touchscreen::Observer gTouchObserver = nullptr;
bool gTouchInitialized = false;
bool gTouching = false;
int gTouchX = 0;
int gTouchY = 0;

// Synthetic drag driven by GEADEV DRAG: a per-frame state machine advanced by
// pollTouch() that feeds gTouchObserver the same Down/Move/Up sequence a
// finger would, at delayUs cadence. While active, hardware samples are
// ignored so a benchmark run can't be disturbed by an accidental touch.
struct SyntheticDrag {
	bool active = false;
	std::uint64_t startUs = 0;
	std::uint64_t delayUs = 0;
	int x1 = 0, y1 = 0, x2 = 0, y2 = 0;
	int steps = 0;
	int lastStep = -1;
};
SyntheticDrag gSyntheticDrag;

void pollSyntheticDrag()
{
	SyntheticDrag &drag = gSyntheticDrag;
	const std::uint64_t elapsedUs = time_us_64() - drag.startUs;
	const int step = drag.delayUs > 0 ? static_cast<int>(elapsedUs / drag.delayUs) : drag.steps + 1;
	if (drag.lastStep < 0) {
		gTouchObserver(gea::platform::touch::Phase::Down, true, drag.x1, drag.y1);
		gTouching = true;
		gTouchX = drag.x1;
		gTouchY = drag.y1;
		drag.lastStep = 0;
		return;
	}
	if (step > drag.steps) {
		gTouchObserver(gea::platform::touch::Phase::Up, false, gTouchX, gTouchY);
		gTouching = false;
		drag.active = false;
		std::printf("GEADEV:OK DRAG x1=%d y1=%d x2=%d y2=%d steps=%d\n",
		            drag.x1, drag.y1, drag.x2, drag.y2, drag.steps);
		std::fflush(stdout);
		return;
	}
	if (step > drag.lastStep) {
		const int clamped = std::min(step, drag.steps);
		const int x = drag.x1 + ((drag.x2 - drag.x1) * clamped) / drag.steps;
		const int y = drag.y1 + ((drag.y2 - drag.y1) * clamped) / drag.steps;
		if (x != gTouchX || y != gTouchY) {
			gTouchObserver(gea::platform::touch::Phase::Move, true, x, y);
			gTouchX = x;
			gTouchY = y;
		}
		drag.lastStep = step;
	}
}
#endif

void flushRectClipped(int x0, int y0, int x1, int y1)
{
	if (!gFramebuffer) return;
	x0 = std::max(0, x0);
	y0 = std::max(0, y0);
	x1 = std::min(gea::rp2350::kPanelWidth - 1, x1);
	y1 = std::min(gea::rp2350::kPanelHeight - 1, y1);
	if (x0 > x1 || y0 > y1) return;
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
	if (gDisplayCanvas.scrollRegionH() > 0) {
#if GEA_RP2350_PANEL_HW_VSCROLL
		if (gScrollRegionY == 0 && gScrollRegionH == gea::rp2350::kPanelHeight) {
			// GRAM mirrors the framebuffer's circular layout and the panel
			// rotates scanout via VSCSAD, so flush each logical rect as its
			// contiguous physical row spans (≤2: a rect crossing the wrap).
			int y = y0;
			while (y <= y1) {
				const int physY = gDisplayCanvas.rowToPhysical(y);
				int run = 1;
				while (y + run <= y1 && gDisplayCanvas.rowToPhysical(y + run) == physY + run) run++;
				gea::rp2350::panelFlushRect(gFramebuffer, gea::rp2350::kPanelWidth, x0, physY, x1, physY + run - 1);
				y += run;
			}
			gFlushCalls++;
			gFlushPixels += (x1 - x0 + 1) * (y1 - y0 + 1);
			return;
		}
#endif
		if (x0 == 0 && x1 == gea::rp2350::kPanelWidth - 1) {
			// Full-width flush of a circularly remapped region: the display-order
			// rows form contiguous framebuffer spans — DMA them straight from
			// PSRAM (panelFlushFullWidthSpans), no per-row CPU copies. Round rows
			// to the panel's window alignment first (extra rows are clean pixels).
			y0 &= ~1;
			y1 = std::min(gea::rp2350::kPanelHeight - 1, y1 | 1);
			int y = y0;
			while (y <= y1) {
				const int phys0 = gDisplayCanvas.rowToPhysical(y);
				int run0 = 1;
				while (y + run0 <= y1 && gDisplayCanvas.rowToPhysical(y + run0) == phys0 + run0) run0++;
				const int yNext = y + run0;
				int run1 = 0;
				int phys1 = 0;
				if (yNext <= y1) {
					phys1 = gDisplayCanvas.rowToPhysical(yNext);
					run1 = 1;
					while (yNext + run1 <= y1 && gDisplayCanvas.rowToPhysical(yNext + run1) == phys1 + run1) run1++;
				}
				gea::rp2350::panelFlushFullWidthSpans(
				    gFramebuffer + static_cast<std::size_t>(phys0) * gea::rp2350::kPanelWidth,
				    run0,
				    run1 > 0 ? gFramebuffer + static_cast<std::size_t>(phys1) * gea::rp2350::kPanelWidth : nullptr,
				    run1,
				    y);
				y = yNext + run1;
			}
			gFlushCalls++;
			gFlushPixels += (x1 - x0 + 1) * (y1 - y0 + 1);
			return;
		}
		gea::rp2350::panelStreamRect(x0,
		                             y0,
		                             x1,
		                             y1,
		                             [](std::uint16_t *dst, int width, int height, int originX, int originY, void *) {
			                             if (!gFramebuffer) return;
			                             for (int row = 0; row < height; ++row) {
				                             const int physicalY = gDisplayCanvas.rowToPhysical(originY + row);
				                             std::copy_n(gFramebuffer + static_cast<std::size_t>(physicalY) * gea::rp2350::kPanelWidth + originX,
				                                         width,
				                                         dst + static_cast<std::size_t>(row) * width);
			                             }
		                             },
		                             nullptr);
	} else
#endif
	gea::rp2350::panelFlushRect(gFramebuffer, gea::rp2350::kPanelWidth, x0, y0, x1, y1);
	gFlushCalls++;
	gFlushPixels += (x1 - x0 + 1) * (y1 - y0 + 1);
}

int flushWindowArea(const FlushWindow &window)
{
	if (window.x0 > window.x1 || window.y0 > window.y1) return 0;
	return (window.x1 - window.x0 + 1) * (window.y1 - window.y0 + 1);
}

FlushWindow uniteFlushWindows(const FlushWindow &a, const FlushWindow &b)
{
	if (flushWindowArea(a) <= 0) return b;
	if (flushWindowArea(b) <= 0) return a;
	return {std::min(a.x0, b.x0), std::min(a.y0, b.y0), std::max(a.x1, b.x1), std::max(a.y1, b.y1)};
}

