geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
bool flushWindowsOverlapOrTouch(const FlushWindow &a, const FlushWindow &b)
{
	return a.x0 <= b.x1 + 1 && a.x1 + 1 >= b.x0 && a.y0 <= b.y1 + 1 && a.y1 + 1 >= b.y0;
}

FlushWindow alignedFlushWindow(const gea::platform::display::DisplayFlushRect &rect)
{
	const present::Rect aligned = present::clampAndAlign({rect.x0, rect.y0, rect.x1, rect.y1},
	                                                     gea::rp2350::kPanelWidth,
	                                                     gea::rp2350::kPanelHeight);
	return {aligned.x0, aligned.y0, aligned.x1, aligned.y1};
}

int collectFlushWindows(const gea::platform::display::DisplayFlushRect *rects,
                        int count,
                        std::array<FlushWindow, kMaxCollectedWindows> &windows)
{
	int windowCount = 0;
	for (int i = 0; i < count; ++i) {
		FlushWindow window = alignedFlushWindow(rects[i]);
		if (flushWindowArea(window) <= 0) continue;

		bool merged = false;
		for (int existing = 0; existing < windowCount; ++existing) {
			if (!flushWindowsOverlapOrTouch(windows[static_cast<std::size_t>(existing)], window)) continue;
			windows[static_cast<std::size_t>(existing)] =
			    uniteFlushWindows(windows[static_cast<std::size_t>(existing)], window);
			merged = true;
			break;
		}
		if (merged) continue;

		if (windowCount < static_cast<int>(windows.size())) {
			windows[static_cast<std::size_t>(windowCount++)] = window;
			continue;
		}

		int best = 0;
		int bestCost = 0x7fffffff;
		for (int existing = 0; existing < windowCount; ++existing) {
			const FlushWindow united = uniteFlushWindows(windows[static_cast<std::size_t>(existing)], window);
			const int cost = flushWindowArea(united) - flushWindowArea(windows[static_cast<std::size_t>(existing)]);
			if (cost < bestCost) {
				bestCost = cost;
				best = existing;
			}
		}
		windows[static_cast<std::size_t>(best)] = uniteFlushWindows(windows[static_cast<std::size_t>(best)], window);
	}

	bool changed = true;
	while (changed) {
		changed = false;
		for (int i = 0; i < windowCount && !changed; ++i) {
			for (int j = i + 1; j < windowCount; ++j) {
				const int areaI = flushWindowArea(windows[static_cast<std::size_t>(i)]);
				const int areaJ = flushWindowArea(windows[static_cast<std::size_t>(j)]);
				const FlushWindow united =
				    uniteFlushWindows(windows[static_cast<std::size_t>(i)], windows[static_cast<std::size_t>(j)]);
				const int extra = flushWindowArea(united) - areaI - areaJ;
				const int allowance = std::min(areaI, areaJ) >> kWindowMergeGapShift;
				if (extra > allowance) continue;
				windows[static_cast<std::size_t>(i)] = united;
				windows[static_cast<std::size_t>(j)] = windows[static_cast<std::size_t>(--windowCount)];
				changed = true;
				break;
			}
		}
	}

	if (windowCount >= 2) {
		FlushWindow bounds = windows[0];
		int areaSum = 0;
		for (int i = 0; i < windowCount; ++i) {
			bounds = uniteFlushWindows(bounds, windows[static_cast<std::size_t>(i)]);
			areaSum += flushWindowArea(windows[static_cast<std::size_t>(i)]);
		}
		const int boundsArea = flushWindowArea(bounds);
		if (boundsArea > 0 &&
		    areaSum * 100 >= boundsArea * kDenseWindowMergeThresholdPercent) {
			windows[0] = bounds;
			windowCount = 1;
		} else {
			const FlushWindow band{0, bounds.y0, gea::rp2350::kPanelWidth - 1, bounds.y1};
			const int bandArea = flushWindowArea(band);
			if (bandArea > 0 && bandArea <= areaSum * 3) {
				windows[0] = band;
				windowCount = 1;
			}
		}
	}

	std::sort(windows.begin(), windows.begin() + windowCount, [](const FlushWindow &a, const FlushWindow &b) {
		if (a.y0 != b.y0) return a.y0 < b.y0;
		if (a.x0 != b.x0) return a.x0 < b.x0;
		if (a.y1 != b.y1) return a.y1 < b.y1;
		return a.x1 < b.x1;
	});
	return windowCount;
}

void setGlobalAlpha(std::uint8_t alpha)
{
	gDisplayAlpha = alpha;
	gDisplayCanvas.setGlobalAlpha(alpha);
}

struct PresentRasterContext {
	const present::Frame *frame = nullptr;
};

// Half-res upscale scratch, one bank per core so core 0 (top rows) and core 1
// (bottom rows) never share it. Sized for a full DMA chunk (64 rows) at half-res.
constexpr int kMaxHalfChunkRows = 64 / 2 + 2;
alignas(4) std::uint16_t gUpscaleScratch[2][(gea::rp2350::kPanelWidth / 2 + 2) * kMaxHalfChunkRows];

struct ChunkRasterJob {
	const present::Frame *frame = nullptr;
	std::uint16_t *pixels = nullptr;
	int width = 0;
	int height = 0;
	int originX = 0;
	int originY = 0;
};

// Rasters chunk rows [ry0, ry1] (inclusive, chunk-local). Safe to run on either
// core: it reads the shared read-only Frame and writes only its own rows of
// `pixels` and its own per-core scratch bank.
void rasterChunkRows(const ChunkRasterJob &job, int ry0, int ry1)
{
	if (ry1 < ry0) return;
	const int rows = ry1 - ry0 + 1;
	if (gPresentScale == 2) {
		// The frame's commands are in half-panel (viewport) coordinates. Raster the
		// half-res source region covering these rows into the scratch, then
		// nearest-2x-expand it into the full-res chunk that streams to the panel.
		const int hx0 = job.originX / 2;
		const int hy0 = (job.originY + ry0) / 2;
		const int hx1 = (job.originX + job.width - 1) / 2;
		const int hy1 = (job.originY + ry1) / 2;
		const int hw = hx1 - hx0 + 1;
		const int hh = hy1 - hy0 + 1;
		std::uint16_t *scratch = gUpscaleScratch[onRenderWorkerCore() ? 1 : 0];
		present::rasterFrameRows(scratch, hx0, hw, hy0, hh,
		                         gea::rp2350::kPanelHeight / 2, *job.frame);
		for (int ly = ry0; ly <= ry1; ++ly) {
			const int sy = (job.originY + ly) / 2 - hy0;
			const std::uint16_t *srow = scratch + static_cast<std::size_t>(sy) * hw;
			std::uint16_t *drow = job.pixels + static_cast<std::size_t>(ly) * job.width;
			for (int lx = 0; lx < job.width; ++lx) {
				drow[lx] = srow[(job.originX + lx) / 2 - hx0];
			}
		}
		return;
	}
	present::rasterFrameRows(job.pixels + static_cast<std::size_t>(ry0) * job.width,
	                         job.originX, job.width, job.originY + ry0, rows,
	                         gea::rp2350::kPanelHeight, *job.frame);
}

#if GEA_RP2350_RENDER_CORE1
void chunkRowsTrampoline(void *ctx, int y0, int y1)
{
	rasterChunkRows(*static_cast<const ChunkRasterJob *>(ctx), y0, y1);
}
#endif

void rasterPresentChunk(std::uint16_t *pixels, int width, int height, int originX, int originY, void *user)
{
	auto *context = static_cast<PresentRasterContext *>(user);
	if (!context || !context->frame) return;
	const ChunkRasterJob job{context->frame, pixels, width, height, originX, originY};
#if GEA_RP2350_RENDER_CORE1
	// Split the chunk: core 1 rasters the bottom half while this core does the top.
	// The FIFO handshake only pays off for chunks tall enough to halve; `job` lives
	// on this core's stack and stays valid because we block here until core 1 is done.
	if (gRenderWorkerReady && height >= 16) {
		const int mid = height / 2;
		gRenderWorkerTask.fn = chunkRowsTrampoline;
		gRenderWorkerTask.ctx = const_cast<ChunkRasterJob *>(&job);
		gRenderWorkerTask.y0 = mid;
		gRenderWorkerTask.y1 = height - 1;
		__dmb();
		multicore_fifo_push_blocking(kRenderWorkerRun);
		rasterChunkRows(job, 0, mid - 1);
		while (multicore_fifo_pop_blocking() != kRenderWorkerDone) {
		}
		__dmb();
		return;
	}
#endif
	rasterChunkRows(job, 0, height - 1);
}

bool presentDirectToPanel(const gea::platform::display::DisplayPresentCommand *commands, int commandCount)
{
#if GEA_RP2350_PANEL_HW_VSCROLL
	// With the panel scroll register engaged, GRAM rows are circularly offset
	// from logical rows; the direct present rasters at logical coordinates, so
	// route those frames through the framebuffer path instead.
	if (gDisplayCanvas.scrollRegionH() > 0 && gScrollOffsetY != 0) return false;
#endif
#if GEA_EMBEDDED_TTF_RUNTIME_FONTS
	for (int i = 0; i < commandCount; ++i) {
		if (commands[i].type == gea::platform::display::DisplayPresentCommandType::FillText) {
			return false;
		}
	}
#endif
	present::Frame current;
	if (!present::extractFrame(commands, commandCount, current)) return false;

	std::array<present::Rect, kMaxCollectedWindows> dirty{};
	int dirtyCount = 0;
	if (gInvalidated || gPresentScale == 2) {
		// scale==2: frame commands are half-res, so a command-space diff can't map to
		// full-res panel windows — always repaint the whole panel (upscaled). For a
		// full-screen 3D flythrough every frame is fully dirty anyway.
		dirty[0] = present::fullScreen(gea::rp2350::kPanelWidth, gea::rp2350::kPanelHeight);
		dirtyCount = 1;
	} else {
		dirtyCount = present::dirtyRects(gPreviousPresentValid ? &gPreviousPresentFrame : nullptr,
		                                 current,
		                                 dirty.data(),
		                                 static_cast<int>(dirty.size()),
		                                 gea::rp2350::kPanelWidth,
		                                 gea::rp2350::kPanelHeight);
	}

	if (dirtyCount > 0) {
		std::array<gea::platform::display::DisplayFlushRect, kMaxCollectedWindows> rects{};
		for (int i = 0; i < dirtyCount; ++i) {
			rects[static_cast<std::size_t>(i)] = {dirty[static_cast<std::size_t>(i)].x0,
			                                     dirty[static_cast<std::size_t>(i)].y0,
			                                     dirty[static_cast<std::size_t>(i)].x1,
			                                     dirty[static_cast<std::size_t>(i)].y1};
		}

		std::array<FlushWindow, kMaxCollectedWindows> windows{};
		const int mergedCount = collectFlushWindows(rects.data(), dirtyCount, windows);
		PresentRasterContext context{&current};
		for (int i = 0; i < mergedCount; ++i) {
			const FlushWindow &window = windows[static_cast<std::size_t>(i)];
			gea::rp2350::panelStreamRect(window.x0,
			                             window.y0,
			                             window.x1,
			                             window.y1,
			                             rasterPresentChunk,
			                             &context);
			gFlushCalls++;
			gFlushPixels += flushWindowArea(window);
		}
	}

	gPreviousPresentFrame = std::move(current);
	gPreviousPresentValid = true;
	gDisplayCanvas.resetDirty();
	gDisplayCanvas.setGlobalAlpha(gDisplayAlpha);
	gInvalidated = false;
	return true;
}

}  // namespace

extern "C" gea::framework::graphics::pixel::native_t *gea_bg_cache(int *cap_px)
{
#if GEA_RP2350_BACKGROUND_CACHE_IN_SRAM
	if (cap_px) *cap_px = gea::rp2350::kPanelWidth * gea::rp2350::kPanelHeight;
	return gSramBackgroundCache;
#else
	if (cap_px) *cap_px = 0;
	return nullptr;
#endif
}

extern "C" void *gea_display_command_buffer(int *cap_commands, int command_size, int command_align)
{
#if GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS > 0
	if (command_size != static_cast<int>(sizeof(gea::embedded::ui::DisplayCommand)) ||
	    command_align > static_cast<int>(alignof(gea::embedded::ui::DisplayCommand))) {
		if (cap_commands) *cap_commands = 0;
		return nullptr;
	}
	if (cap_commands) *cap_commands = GEA_RP2350_DISPLAY_COMMAND_BUFFER_COMMANDS;
	return gSramDisplayCommandBuffer;
#elif GEA_RP2350_DISPLAY_COMMAND_BUFFER_BYTES > 0
	if (command_size <= 0) {
		if (cap_commands) *cap_commands = 0;
		return nullptr;
	}
	if (command_align <= 0) command_align = 1;
	const std::uintptr_t raw = reinterpret_cast<std::uintptr_t>(gSramDisplayCommandBuffer);
	const std::uintptr_t aligned = (raw + static_cast<std::uintptr_t>(command_align - 1)) &
	                               ~static_cast<std::uintptr_t>(command_align - 1);
	const std::size_t offset = static_cast<std::size_t>(aligned - raw);
	const std::size_t usable = offset < sizeof(gSramDisplayCommandBuffer) ? sizeof(gSramDisplayCommandBuffer) - offset : 0;
	if (cap_commands) *cap_commands = static_cast<int>(usable / static_cast<std::size_t>(command_size));
	return usable >= static_cast<std::size_t>(command_size) ? reinterpret_cast<void *>(aligned) : nullptr;
#else
	(void)command_size;
	(void)command_align;
	if (cap_commands) *cap_commands = 0;
	return nullptr;
#endif
}

