geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
extern "C" bool gea_render_parallel_submit(void (*fn)(void *, int, int), void *ctx, int y0, int y1)
{
#if GEA_RP2350_RENDER_CORE1
	if (!fn || y0 > y1 || !gRenderWorkerReady || gRenderWorkerInFlight || onRenderWorkerCore())
		return false;
	gRenderWorkerTask = {fn, ctx, y0, y1};
	__dmb();
	gRenderWorkerInFlight = true;
	multicore_fifo_push_blocking(kRenderWorkerRun);
	return true;
#else
	(void)fn;
	(void)ctx;
	(void)y0;
	(void)y1;
	return false;
#endif
}

extern "C" void gea_render_parallel_wait()
{
#if GEA_RP2350_RENDER_CORE1
	if (!gRenderWorkerInFlight)
		return;
#if GEA_RP2350_RENDER_CORE1_WAIT_TIMEOUT_US > 0
	const std::uint64_t startUs = time_us_64();
	while (true)
	{
		if (multicore_fifo_rvalid() && multicore_fifo_pop_blocking() == kRenderWorkerDone)
			break;
		if (time_us_64() - startUs >= GEA_RP2350_RENDER_CORE1_WAIT_TIMEOUT_US)
		{
			gRenderWorkerReady = false;
			gRenderWorkerInFlight = false;
			return;
		}
		tight_loop_contents();
	}
#else
	while (multicore_fifo_pop_blocking() != kRenderWorkerDone)
	{
	}
#endif
	__dmb();
	gRenderWorkerInFlight = false;
#endif
}

extern "C" void gea_render_parallel_merge_dirty()
{
#if GEA_RP2350_RENDER_CORE1
	int x0 = 0, y0 = 0, x1 = -1, y1 = -1;
	if (gRenderWorkerCanvas.dirty(&x0, &y0, &x1, &y1)) {
		gDisplayCanvas.markDirty(x0, y0, x1, y1);
		gRenderWorkerCanvas.resetDirty();
	}
#endif
}

extern "C" int gea_current_render_core()
{
#if GEA_RP2350_RENDER_CORE1
	return get_core_num();
#else
	return 0;
#endif
}

extern "C" int gea_render_parallel_main_share_permille()
{
#if GEA_RP2350_RENDER_CORE1
	return 500;
#else
	return 500;
#endif
}

extern "C" bool gea_pie_blend_available()
{
	return false;
}

extern "C" bool gea_rgb565_lut_blend_available()
{
	return GEA_RP2350_PIE_BLEND != 0;
}

extern "C" bool gea_rgb565_lut_blend_const_alpha_available()
{
	return GEA_RP2350_PIE_BLEND != 0;
}

extern "C" void __not_in_flash_func(gea_rgb565_lut_blend_const_alpha_span)(std::uint16_t *dst,
                                                                            const std::uint16_t *colorRgb565,
                                                                            std::int16_t a5,
                                                                            std::int32_t bucketFx,
                                                                            std::int32_t dBucketFx,
                                                                            int count)
{
#if GEA_RP2350_PIE_BLEND
	if (count <= 0)
		return;
	const std::uint32_t av = static_cast<std::uint32_t>(a5);
	if (av == 0)
		return;
	auto swap16 = [](std::uint16_t v) -> std::uint16_t {
#if GEA_EMBEDDED_PIXEL_PANEL_ENDIAN
		return __builtin_bswap16(v);
#else
		return v;
#endif
	};
	auto clampBucket = [](std::int32_t fx) -> int {
		int bucket = fx >> 16;
		if (bucket < 0)
			return 0;
		if (bucket > 250)
			return 250;
		return bucket;
	};
	auto splitInsideBuckets = [](std::int32_t fx0, std::int32_t step32, int n, int &insideStart, int &insideEnd) {
		insideStart = 0;
		insideEnd = 0;
		if (n <= 0)
			return;
		constexpr std::int64_t kBucketHi = 251LL << 16;
		const std::int64_t start = fx0;
		const std::int64_t step = step32;
		const std::int64_t last = start + static_cast<std::int64_t>(n - 1) * step;
		if (step == 0) {
			if (start >= 0 && start < kBucketHi)
				insideEnd = n;
			return;
		}
		auto ceilDivPositive = [](std::int64_t a, std::int64_t b) -> std::int64_t {
			return (a + b - 1) / b;
		};
		std::int64_t first = 0;
		std::int64_t end = n;
		if (step > 0) {
			if (start < 0)
				first = ceilDivPositive(-start, step);
			if (first >= n)
				return;
			if (start >= kBucketHi)
				end = 0;
			else if (last >= kBucketHi)
				end = (kBucketHi - 1 - start) / step + 1;
		} else {
			const std::int64_t down = -step;
			if (start >= kBucketHi)
				first = ceilDivPositive(start - (kBucketHi - 1), down);
			if (first >= n)
				return;
			if (start < 0)
				end = 0;
			else if (last < 0)
				end = start / down + 1;
		}
		if (end > n)
			end = n;
		if (end <= first)
			return;
		insideStart = static_cast<int>(first);
		insideEnd = static_cast<int>(end);
	};
		auto advanceFx = [](std::int32_t fx, std::int32_t step, int n) -> std::int32_t {
			return static_cast<std::int32_t>(static_cast<std::int64_t>(fx) + static_cast<std::int64_t>(step) * n);
		};
		auto halfBlendRgb565 = [](std::uint16_t fg, std::uint16_t bg) -> std::uint16_t {
			const std::uint32_t x = static_cast<std::uint32_t>(fg ^ bg);
			return static_cast<std::uint16_t>((fg & bg) + ((x & 0xF7DEu) >> 1) + (x & 0x0821u));
		};
		auto halfBlendRgb565Pair = [](std::uint32_t fg, std::uint32_t bg) -> std::uint32_t {
			const std::uint32_t x = fg ^ bg;
			return ((fg & bg) + ((x & 0xF7DEF7DEu) >> 1) + (x & 0x08210821u));
		};
		auto swap16Pair = [](std::uint32_t v) -> std::uint32_t {
#if GEA_EMBEDDED_PIXEL_PANEL_ENDIAN
			return ((v & 0x00FF00FFu) << 8) | ((v & 0xFF00FF00u) >> 8);
#else
			return v;
#endif
		};
		auto loadPairNormal = [&](const std::uint16_t *p) -> std::uint32_t {
			std::uint32_t stored = 0;
			std::memcpy(&stored, p, sizeof(stored));
			return swap16Pair(stored);
		};
		auto storePairNormal = [&](std::uint16_t *p, std::uint32_t normal) {
			const std::uint32_t stored = swap16Pair(normal);
			std::memcpy(p, &stored, sizeof(stored));
		};
		auto halfBlend = [&](std::uint16_t fc, std::uint16_t storedDst) -> std::uint16_t {
			return swap16(halfBlendRgb565(fc, swap16(storedDst)));
		};
		auto paintHalfConst = [&](int bucket, int n) {
			const std::uint16_t fc = colorRgb565[bucket];
			if ((reinterpret_cast<std::uintptr_t>(dst) & 2u) && n > 0) {
				*dst = halfBlend(fc, *dst);
				dst++;
				n--;
			}
			const std::uint32_t fgPair = static_cast<std::uint32_t>(fc) |
			                             (static_cast<std::uint32_t>(fc) << 16);
			while (n >= 4) {
				storePairNormal(dst, halfBlendRgb565Pair(fgPair, loadPairNormal(dst)));
				storePairNormal(dst + 2, halfBlendRgb565Pair(fgPair, loadPairNormal(dst + 2)));
				dst += 4;
				n -= 4;
			}
			while (n >= 2) {
				storePairNormal(dst, halfBlendRgb565Pair(fgPair, loadPairNormal(dst)));
				dst += 2;
				n -= 2;
			}
			if (n > 0) {
				*dst = halfBlend(fc, *dst);
				dst++;
			}
		};
		auto paintHalfUnclamped = [&](std::int32_t &fx, int n) {
			if ((reinterpret_cast<std::uintptr_t>(dst) & 2u) && n > 0) {
				const std::uint16_t fc = colorRgb565[fx >> 16];
				*dst = halfBlend(fc, *dst);
				dst++;
				fx += dBucketFx;
				n--;
			}
			while (n >= 4) {
				const std::uint16_t fc0 = colorRgb565[fx >> 16];
				const std::int32_t fx1 = fx + dBucketFx;
				const std::uint16_t fc1 = colorRgb565[fx1 >> 16];
				const std::int32_t fx2 = fx1 + dBucketFx;
				const std::uint16_t fc2 = colorRgb565[fx2 >> 16];
				const std::int32_t fx3 = fx2 + dBucketFx;
				const std::uint16_t fc3 = colorRgb565[fx3 >> 16];
				const std::uint32_t fgPair0 = static_cast<std::uint32_t>(fc0) |
				                              (static_cast<std::uint32_t>(fc1) << 16);
				const std::uint32_t fgPair1 = static_cast<std::uint32_t>(fc2) |
				                              (static_cast<std::uint32_t>(fc3) << 16);
				storePairNormal(dst, halfBlendRgb565Pair(fgPair0, loadPairNormal(dst)));
				storePairNormal(dst + 2, halfBlendRgb565Pair(fgPair1, loadPairNormal(dst + 2)));
				dst += 4;
				fx = fx3 + dBucketFx;
				n -= 4;
			}
			while (n >= 2) {
				const std::uint16_t fc0 = colorRgb565[fx >> 16];
				const std::int32_t fx1 = fx + dBucketFx;
				const std::uint16_t fc1 = colorRgb565[fx1 >> 16];
				const std::uint32_t fgPair = static_cast<std::uint32_t>(fc0) |
				                             (static_cast<std::uint32_t>(fc1) << 16);
				storePairNormal(dst, halfBlendRgb565Pair(fgPair, loadPairNormal(dst)));
				dst += 2;
				fx = fx1 + dBucketFx;
				n -= 2;
			}
			if (n > 0) {
				const std::uint16_t fc = colorRgb565[fx >> 16];
				*dst = halfBlend(fc, *dst);
				dst++;
				fx += dBucketFx;
			}
		};
	if (av == 16) {
		int insideStart = 0;
		int insideEnd = 0;
		splitInsideBuckets(bucketFx, dBucketFx, count, insideStart, insideEnd);
		if (insideEnd > insideStart) {
			if (insideStart > 0) {
				paintHalfConst(clampBucket(bucketFx), insideStart);
				bucketFx = advanceFx(bucketFx, dBucketFx, insideStart);
			}
			if (dBucketFx == 0)
				paintHalfConst(bucketFx >> 16, insideEnd - insideStart);
			else
				paintHalfUnclamped(bucketFx, insideEnd - insideStart);
			if (insideEnd < count)
				paintHalfConst(clampBucket(bucketFx), count - insideEnd);
			return;
		}
		paintHalfConst(clampBucket(bucketFx), count);
		return;
	}

