geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
	const std::uint32_t inv = 32u - av;
	while (count-- > 0) {
		int bucket = bucketFx >> 16;
		if (bucket < 0)
			bucket = 0;
		else if (bucket > 250)
			bucket = 250;
		const std::uint16_t fc = colorRgb565[bucket];
		const std::uint16_t dc = swap16(*dst);
		const std::uint32_t f = (static_cast<std::uint32_t>(fc) | (static_cast<std::uint32_t>(fc) << 16)) & 0x07E0F81Fu;
		const std::uint32_t b = (static_cast<std::uint32_t>(dc) | (static_cast<std::uint32_t>(dc) << 16)) & 0x07E0F81Fu;
		const std::uint32_t o = ((f * av + b * inv + 0x02008010u) >> 5) & 0x07E0F81Fu;
		const std::uint16_t rn = static_cast<std::uint16_t>(o | (o >> 16));
		*dst++ = swap16(rn);
		bucketFx += dBucketFx;
	}
#else
	(void)dst;
	(void)colorRgb565;
	(void)a5;
	(void)bucketFx;
	(void)dBucketFx;
	(void)count;
#endif
}

extern "C" void __not_in_flash_func(gea_rgb565_lut_blend_span)(std::uint16_t *dst,
                                                                const std::uint16_t *colorRgb565,
                                                                const std::uint8_t *a5,
                                                                std::int32_t bucketFx,
                                                                std::int32_t dBucketFx,
                                                                int count)
{
#if GEA_RP2350_PIE_BLEND
	auto swap16 = [](std::uint16_t v) -> std::uint16_t {
#if GEA_EMBEDDED_PIXEL_PANEL_ENDIAN
		return __builtin_bswap16(v);
#else
		return v;
#endif
	};

	while (count-- > 0) {
		int bucket = bucketFx >> 16;
		if (bucket < 0)
			bucket = 0;
		else if (bucket > 250)
			bucket = 250;
		const std::uint32_t av = static_cast<std::uint32_t>(a5[bucket]);
		if (av == 0) {
			dst++;
			bucketFx += dBucketFx;
			continue;
		}
		const std::uint16_t fc = colorRgb565[bucket];
		const std::uint16_t dc = swap16(*dst);
		const std::uint32_t f = (static_cast<std::uint32_t>(fc) | (static_cast<std::uint32_t>(fc) << 16)) & 0x07E0F81Fu;
		const std::uint32_t b = (static_cast<std::uint32_t>(dc) | (static_cast<std::uint32_t>(dc) << 16)) & 0x07E0F81Fu;
		const std::uint32_t o = ((f * av + b * (32u - av) + 0x02008010u) >> 5) & 0x07E0F81Fu;
		const std::uint16_t rn = static_cast<std::uint16_t>(o | (o >> 16));
		*dst++ = swap16(rn);
		bucketFx += dBucketFx;
	}
#else
	(void)dst;
	(void)colorRgb565;
	(void)a5;
	(void)bucketFx;
	(void)dBucketFx;
	(void)count;
#endif
}

void *operator new(std::size_t size)
{
	return allocBlock(size, alignof(std::max_align_t));
}

void *operator new[](std::size_t size)
{
	return allocBlock(size, alignof(std::max_align_t));
}

void *operator new(std::size_t size, std::align_val_t alignment)
{
	return allocBlock(size, static_cast<std::size_t>(alignment));
}

void *operator new[](std::size_t size, std::align_val_t alignment)
{
	return allocBlock(size, static_cast<std::size_t>(alignment));
}

void *operator new(std::size_t size, const std::nothrow_t &) noexcept
{
	return allocBlock(size, alignof(std::max_align_t));
}

void *operator new[](std::size_t size, const std::nothrow_t &) noexcept
{
	return allocBlock(size, alignof(std::max_align_t));
}

void operator delete(void *ptr) noexcept
{
	freeBlock(ptr);
}

void operator delete[](void *ptr) noexcept
{
	freeBlock(ptr);
}

void operator delete(void *ptr, std::size_t) noexcept
{
	freeBlock(ptr);
}

void operator delete[](void *ptr, std::size_t) noexcept
{
	freeBlock(ptr);
}

void operator delete(void *ptr, std::align_val_t) noexcept
{
	freeBlock(ptr);
}

void operator delete[](void *ptr, std::align_val_t) noexcept
{
	freeBlock(ptr);
}

void operator delete(void *ptr, std::size_t, std::align_val_t) noexcept
{
	freeBlock(ptr);
}

void operator delete[](void *ptr, std::size_t, std::align_val_t) noexcept
{
	freeBlock(ptr);
}

namespace gea::rp2350 {

void memoryInit()
{
	const size_t maxFree = rp_mem_max_free_size();
	gUseRpAllocator = maxFree > 0;
	std::printf("rp2350 psram allocator: max_free=%u enabled=%d\n", static_cast<unsigned>(maxFree), gUseRpAllocator ? 1 : 0);
}

void boardIoInit()
{
	if (board::power.powerHold >= 0) {
		gpio_init(board::power.powerHold);
		gpio_set_dir(board::power.powerHold, GPIO_OUT);
		gpio_put(board::power.powerHold, 1);
	}

	if (board::power.powerKey >= 0) {
		gpio_init(board::power.powerKey);
		gpio_pull_up(board::power.powerKey);
		gpio_set_dir(board::power.powerKey, GPIO_IN);
	}

	adc_init();
	if (board::power.batteryAdc >= 0) {
		adc_gpio_init(board::power.batteryAdc);
		adc_select_input(board::power.batteryAdcChannel);
	}

	i2c_init(boardI2c(), board::i2c.frequencyHz);
	gpio_set_function(board::i2c.sda, GPIO_FUNC_I2C);
	gpio_set_function(board::i2c.scl, GPIO_FUNC_I2C);
	gpio_pull_up(board::i2c.sda);
	gpio_pull_up(board::i2c.scl);

#if GEA_RP2350_HAS_BUTTONS
	for (std::size_t i = 0; i < board::buttons.size(); ++i) {
		const auto &button = board::buttons[i];
		gpio_init(button.pin);
		gpio_set_dir(button.pin, GPIO_IN);
		if (button.pullUp) gpio_pull_up(button.pin);
		gButtonDown[i] = button.activeLow ? gpio_get(button.pin) == 0 : gpio_get(button.pin) != 0;
	}
#endif
}

void pollTouch()
{
#if GEA_RP2350_HAS_TOUCH
	if (!gTouchInitialized || !gTouchObserver) return;
	if (gSyntheticDrag.active) {
		pollSyntheticDrag();
		return;
	}
	gea::chips::ft6336::MultiTouchSample sample{};
	const bool ok = gTouchCore.readMulti(gTouchBus, sample);
	if (ok && sample.count > 0) {
		const int x = std::clamp(sample.x[0], 0, kPanelWidth - 1);
		const int y = std::clamp(sample.y[0], 0, kPanelHeight - 1);
		const auto phase = gTouching ? gea::platform::touch::Phase::Move : gea::platform::touch::Phase::Down;
		if (!gTouching || x != gTouchX || y != gTouchY) {
			gTouchObserver(phase, true, x, y);
		}
		gTouching = true;
		gTouchX = x;
		gTouchY = y;
		return;
	}
	if (gTouching) {
		gTouchObserver(gea::platform::touch::Phase::Up, false, gTouchX, gTouchY);
		gTouching = false;
	}
#endif
}

int scanoutRowToPhysical(int row)
{
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
	if (gDisplayCanvas.scrollRegionH() > 0) return gDisplayCanvas.rowToPhysical(row);
#endif
	return row;
}

