geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
bool startSyntheticDrag(int x1, int y1, int x2, int y2, int steps, int delayMs)
{
#if GEA_RP2350_HAS_TOUCH
	if (!gTouchInitialized || !gTouchObserver) return false;
	if (gSyntheticDrag.active) return false;
	gSyntheticDrag.x1 = std::clamp(x1, 0, kPanelWidth - 1);
	gSyntheticDrag.y1 = std::clamp(y1, 0, kPanelHeight - 1);
	gSyntheticDrag.x2 = std::clamp(x2, 0, kPanelWidth - 1);
	gSyntheticDrag.y2 = std::clamp(y2, 0, kPanelHeight - 1);
	gSyntheticDrag.steps = std::clamp(steps, 1, 256);
	gSyntheticDrag.delayUs = static_cast<std::uint64_t>(std::clamp(delayMs, 1, 250)) * 1000u;
	gSyntheticDrag.lastStep = -1;
	gSyntheticDrag.startUs = time_us_64();
	gSyntheticDrag.active = true;
	return true;
#else
	(void)x1; (void)y1; (void)x2; (void)y2; (void)steps; (void)delayMs;
	return false;
#endif
}

void pollButtons()
{
#if GEA_RP2350_HAS_BUTTONS
	// Press edge always queues one keydown. Buttons flagged `repeat` also
	// auto-repeat while held — an initial delay, then a steady interval —
	// matching a keyboard's typematic repeat, so holding Up/Down keeps the
	// view scrolling instead of nudging once per press.
	constexpr std::uint64_t kButtonRepeatInitialDelayUs = 300000;  // 300 ms hold before repeat
	constexpr std::uint64_t kButtonRepeatIntervalUs = 55000;       // ~18 repeats/sec
	const std::uint64_t nowUs = time_us_64();
	for (std::size_t i = 0; i < board::buttons.size(); ++i) {
		const auto &button = board::buttons[i];
		const bool down = button.activeLow ? gpio_get(button.pin) == 0 : gpio_get(button.pin) != 0;
		if (down && !gButtonDown[i]) {
			gea::framework::input::queueKeyDown(button.keyCode);
			gButtonNextRepeatUs[i] = nowUs + kButtonRepeatInitialDelayUs;
		} else if (down && button.repeat && nowUs >= gButtonNextRepeatUs[i]) {
			gea::framework::input::queueKeyDown(button.keyCode);
			gButtonNextRepeatUs[i] = nowUs + kButtonRepeatIntervalUs;
		}
		gButtonDown[i] = down;
	}
#endif
}

void dispatchQueuedEvents()
{
	gea::framework::events::Event event{};
	while (gea::framework::services::FrameScheduler::receiveEvent(&event)) {
		if (event.type == gea::framework::events::EventType::Touch) {
			gea::framework::events::TouchRuntime::dispatchEvent(event);
		}
	}
#if GEA_RP2350_HAS_BUTTONS
	dispatchKeyInput();
#endif
}

}  // namespace gea::rp2350

namespace gea::framework::memory {

void *Allocator::allocatePreferSpiram(std::size_t size, std::size_t alignment)
{
	return allocBlock(size, alignment);
}

void *Allocator::reallocatePreferSpiram(void *ptr, std::size_t size)
{
	return reallocBlock(ptr, size);
}

void Allocator::free(void *ptr) noexcept
{
	freeBlock(ptr);
}

double MemoryBackend::internalFree() { return 0.0; }
double MemoryBackend::internalLargestFreeBlock() { return 0.0; }
double MemoryBackend::internalMinimumFree() { return 0.0; }
double MemoryBackend::psramFree() { return static_cast<double>(rp_mem_max_free_size()); }
double MemoryBackend::currentTaskStackHighWaterMark() { return 0.0; }
double MemoryBackend::geaMainStackBytes() { return 0.0; }
double MemoryBackend::geaInitStackBytes() { return 0.0; }
double MemoryBackend::appFrameStackWords() { return 0.0; }
double MemoryBackend::appFrameStackBytes() { return 0.0; }
double MemoryBackend::displayFlushConfiguredRows() { return static_cast<double>(gFlushRows); }
double MemoryBackend::displayFlushConfiguredDepth() { return static_cast<double>(gFlushDepth); }
double MemoryBackend::displayFlushBufferMaxBytes() { return static_cast<double>(gea::rp2350::kPanelWidth * gFlushRows * 2 * gFlushDepth); }
double MemoryBackend::displayFlushRows() { return static_cast<double>(gFlushRows); }
double MemoryBackend::displayFlushDepth() { return static_cast<double>(gFlushDepth); }
double MemoryBackend::displayFlushBufferBytes() { return static_cast<double>(gea::rp2350::kPanelWidth * gFlushRows * 2 * gFlushDepth); }
double MemoryBackend::allocationSramCount() { return static_cast<double>(gSramAllocStats.allocCount); }
double MemoryBackend::allocationPsramCount() { return static_cast<double>(gPsramAllocStats.allocCount); }
double MemoryBackend::allocationSramBytes() { return static_cast<double>(gSramAllocStats.liveBytes); }
double MemoryBackend::allocationPsramBytes() { return static_cast<double>(gPsramAllocStats.liveBytes); }
double MemoryBackend::allocationSramPeakBytes() { return static_cast<double>(gSramAllocStats.peakBytes); }
double MemoryBackend::allocationPsramPeakBytes() { return static_cast<double>(gPsramAllocStats.peakBytes); }

}  // namespace gea::framework::memory

namespace gea::host {

double setTimeout(TimerCallback callback, double delayMs)
{
	if (!callback) return 0;
	for (auto &timer : gTimers) {
		if (timer.active) continue;
		timer.id = gNextTimerId++;
		timer.callback = std::move(callback);
		timer.delayMs = std::max(0.0, delayMs);
		timer.nextFireMs = gLastTimestampMs + timer.delayMs;
		timer.interval = false;
		timer.active = true;
		return timer.id;
	}
	return 0;
}

double setInterval(TimerCallback callback, double delayMs)
{
	if (!callback) return 0;
	for (auto &timer : gTimers) {
		if (timer.active) continue;
		timer.id = gNextTimerId++;
		timer.callback = std::move(callback);
		timer.delayMs = std::max(1.0, delayMs);
		timer.nextFireMs = gLastTimestampMs + timer.delayMs;
		timer.interval = true;
		timer.active = true;
		return timer.id;
	}
	return 0;
}

void clearTimeout(double id)
{
	for (auto &timer : gTimers) {
		if (timer.id == id) timer.active = false;
	}
}

void clearInterval(double id)
{
	clearTimeout(id);
}

void resetScheduledTimers()
{
	for (auto &timer : gTimers) timer.active = false;
}

double requestAnimationFrame(AnimationFrameCallback callback)
{
	if (!callback || gPendingRafCount >= static_cast<int>(gPendingRaf.size())) return 0;
	const double id = gNextTimerId++;
	gPendingRaf[static_cast<std::size_t>(gPendingRafCount++)] = std::move(callback);
	return id;
}

void runAnimationFrameCallbacks(double timestampMs)
{
	gLastTimestampMs = timestampMs;
	for (auto &timer : gTimers) {
		if (!timer.active || timer.nextFireMs > timestampMs || !timer.callback) continue;
		timer.callback();
		if (timer.interval) timer.nextFireMs = timestampMs + timer.delayMs;
		else timer.active = false;
	}

	const int count = gPendingRafCount;
	for (int i = 0; i < count; ++i) {
		gActiveRaf[static_cast<std::size_t>(i)] = std::move(gPendingRaf[static_cast<std::size_t>(i)]);
		gPendingRaf[static_cast<std::size_t>(i)] = nullptr;
	}
	gPendingRafCount = 0;
	for (int i = 0; i < count; ++i) {
		auto &callback = gActiveRaf[static_cast<std::size_t>(i)];
		if (callback) callback(timestampMs);
		callback = nullptr;
	}
}

void resetAnimationFrameCallbacks()
{
	for (auto &callback : gPendingRaf) callback = nullptr;
	for (auto &callback : gActiveRaf) callback = nullptr;
	gPendingRafCount = 0;
}

void animationFramePerfStatsReset() {}
AnimationFramePerfStats animationFramePerfStatsRead() { return {}; }

AudioDestinationProperty::operator AudioDestinationNode() const { return AudioDestinationNode(); }
AudioDestinationProperty::operator double() const { return 0.0; }
AudioContextCurrentTimeProperty::operator double() const { return 0.0; }
const AudioParamValueProperty &AudioParamValueProperty::operator=(double) const { return *this; }
AudioParamValueProperty::operator double() const { return 0.0; }
const AudioParam &AudioParam::operator=(double) const { return *this; }
void AudioParam::setValueAtTime(double, double) const {}
const OscillatorTypeProperty &OscillatorTypeProperty::operator=(double) const { return *this; }
const OscillatorTypeProperty &OscillatorTypeProperty::operator=(const char *) const { return *this; }
const OscillatorTypeProperty &OscillatorTypeProperty::operator=(const std::string &) const { return *this; }
void OscillatorNode::connect(AudioDestinationNode) const {}
void OscillatorNode::connect(AudioDestinationProperty) const {}
void OscillatorNode::connect(double) const {}
void OscillatorNode::start(double) const {}
void OscillatorNode::stop(double) const {}
AudioDestinationNode AudioBufferSourceNode::connect(AudioDestinationNode destination) const
{
	connected = true;
	return destination;
}
AudioDestinationNode AudioBufferSourceNode::connect(AudioDestinationProperty destination) const
{
	return connect(static_cast<AudioDestinationNode>(destination));
}
AudioDestinationNode AudioBufferSourceNode::connect(double destinationHandle) const
{
	return connect(AudioDestinationNode(destinationHandle));
}
void AudioBufferSourceNode::start(double) const {}
void AudioBufferSourceNode::stop(double) const {}
OscillatorNode AudioContext::createOscillator() const { return OscillatorNode(); }
AudioBufferSourceNode AudioContext::createBufferSource() const { return AudioBufferSourceNode(); }
AudioBuffer AudioContext::decodeAudioData(const std::vector<std::uint8_t> &) const { return AudioBuffer(); }

