geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
HTMLAudioElement::HTMLAudioElement(const char *src) : src_(src ? src : "") {}
HTMLAudioElement::HTMLAudioElement(const std::string &src) : src_(src) {}
HTMLAudioElement::HTMLAudioElement(const gea::embedded::ui::NodeHandle &node) : nodeId_(node.id()) {}
std::string HTMLAudioElement::src() const { return src_; }
void HTMLAudioElement::setSrc(const std::string &src) { src_ = src; }
bool HTMLAudioElement::play() const { return false; }
void HTMLAudioElement::pause() const {}

}  // namespace gea::host

// gea_host_image_load_asset_path now comes from core/packages/host/host/image.cpp
// (real embedded-asset lookup + ImageStore decode), compiled into this target.

namespace gea::framework::services {

EventQueue FrameScheduler::createEventQueue()
{
	gEventQueueStarted = true;
	return EventQueue(&gEvents);
}

EventQueue FrameScheduler::eventQueue()
{
	return gEventQueueStarted ? EventQueue(&gEvents) : EventQueue();
}

bool FrameScheduler::sendEvent(const gea::framework::events::Event &event, int)
{
	const int next = (gEventTail + 1) % static_cast<int>(gEvents.size());
	if (next == gEventHead) return false;
	gEvents[static_cast<std::size_t>(gEventTail)] = event;
	gEventTail = next;
	return true;
}

bool FrameScheduler::receiveEvent(gea::framework::events::Event *event)
{
	if (gEventHead == gEventTail) return false;
	if (event) *event = gEvents[static_cast<std::size_t>(gEventHead)];
	gEventHead = (gEventHead + 1) % static_cast<int>(gEvents.size());
	return true;
}

void FrameScheduler::start(EventQueue queue)
{
	gEventQueueStarted = static_cast<bool>(queue);
}

void FrameScheduler::runFrame(const FrameCallbacks &callbacks)
{
	if (callbacks.frame) callbacks.frame(nowMs(), callbacks.context);
}

bool FrameScheduler::takeCatchUpRequest() { return false; }
bool FrameScheduler::drainFramesAndCheckInput() { return gEventHead != gEventTail; }
void FrameScheduler::setVsyncDriven(bool driven) { gVsyncDriven = driven; }
bool FrameScheduler::vsyncDriven() { return gVsyncDriven; }
void FrameScheduler::notifyVsyncFromISR() {}

void FrameScheduler::setFrameIntervalMs(int intervalMs)
{
	if (intervalMs < kMinFrameIntervalMs) intervalMs = kMinFrameIntervalMs;
	if (intervalMs > kMaxFrameIntervalMs) intervalMs = kMaxFrameIntervalMs;
	gFrameIntervalMs = intervalMs;
}

int FrameScheduler::frameIntervalMs()
{
	return gFrameIntervalMs;
}

void FrameScheduler::setFrameRate(double fps)
{
	if (fps <= 0.0) return;
	setFrameIntervalMs(static_cast<int>((1000.0 / fps) + 0.5));
}

double FrameScheduler::frameRate()
{
	return gFrameIntervalMs > 0 ? 1000.0 / static_cast<double>(gFrameIntervalMs) : 0.0;
}

int FrameScheduler::nowMs()
{
	return static_cast<int>(time_us_64() / 1000u);
}

bool StorageService::init() { return true; }
bool StorageService::getString(const char *, char *, unsigned) { return false; }
bool StorageService::setString(const char *, const char *) { return false; }
bool StorageService::loadKv(std::string &out)
{
	out.clear();
	return false;
}
void StorageService::saveKv(const std::string &) {}

}  // namespace gea::framework::services

namespace gea::framework::app {

void Application::init(int width, int height, double devicePixelRatio)
{
	gea::embedded::ui::Document::setPreferredMountSize(width, height);
	gea::embedded::ui::setViewportMetrics(width, height, devicePixelRatio);
}

void Application::frame(int timestampMs)
{
	generated::drainMicrotasks();
	gea::host::runAnimationFrameCallbacks(static_cast<double>(timestampMs));
	gea::embedded::ui::Document::instance().frame(timestampMs);
	generated::drainMicrotasks();
	gea::embedded::ui::Document::instance().refreshMountedIfDirty();
}

void Application::toggleSettings() {}
void applicationFramePerfStatsReset() {}
void applicationFramePerfStatsAdd(ApplicationFramePhase, std::int64_t) {}
void applicationFramePerfStatsAdd(ApplicationFramePerfStats &, ApplicationFramePhase, std::int64_t) {}
ApplicationFramePerfStats applicationFramePerfStatsRead() { return {}; }
void applicationFramePhaseSet(ApplicationFramePhase) {}
ApplicationFramePhase applicationFramePhaseRead() { return ApplicationFramePhase::Idle; }
const char *applicationFramePhaseName(ApplicationFramePhase phase)
{
	switch (phase) {
	case ApplicationFramePhase::DrainMicrotasks:
		return "drainMicrotasks";
	case ApplicationFramePhase::AnimationFrameCallbacks:
		return "animationFrameCallbacks";
	case ApplicationFramePhase::StyleRecompute:
		return "styleRecompute";
	case ApplicationFramePhase::DocumentFrame:
		return "documentFrame";
	case ApplicationFramePhase::RefreshMounted:
		return "refreshMounted";
	case ApplicationFramePhase::Idle:
	default:
		return "idle";
	}
}

}  // namespace gea::framework::app

namespace gea::platform::display {

bool Display::init()
{
	if (!gFramebuffer) {
		const auto bytes = static_cast<std::size_t>(gea::rp2350::kPanelWidth) * gea::rp2350::kPanelHeight * sizeof(Pixel);
#if GEA_RP2350_FRAMEBUFFER_IN_SRAM
		gFramebuffer = gSramFramebuffer;
#else
		gFramebuffer = static_cast<Pixel *>(gea::framework::memory::Allocator::allocatePreferSpiram(bytes, alignof(Pixel)));
		if (!gFramebuffer) return false;
#endif
		std::memset(gFramebuffer, 0, bytes);
		gDisplayCanvas.bindPixels(gFramebuffer, gea::rp2350::kPanelWidth, gea::rp2350::kPanelHeight);
	}
#if GEA_RP2350_RENDER_CORE1
	startRenderWorker();
#endif
	const bool ok = gea::rp2350::panelInit();
	gea::rp2350::panelSetBrightness(gBrightness);
	return ok;
}

bool Display::start() { return init(); }
gea::framework::graphics::Canvas *Display::canvas() { return &activeDisplayCanvas(); }
bool Display::framebufferIsPanelDirect() { return true; }
bool Display::panelScanoutSurface(std::uint16_t **outBuffer, int *outWidth, int *outHeight)
{
	if (outBuffer) *outBuffer = gFramebuffer;
	if (outWidth) *outWidth = gea::rp2350::kPanelWidth;
	if (outHeight) *outHeight = gea::rp2350::kPanelHeight;
	return gFramebuffer != nullptr;
}
bool Display::panelDirectTarget(int, int, int, int, std::uint16_t **, int *, int *, int *, int *, int *, int *, int *, int *) { return false; }
void Display::flipPanelToBack() {}
bool Display::copySnapshotRgb565(std::uint16_t *dst, int pixelCapacity, int *width, int *height, bool)
{
	if (width) *width = gea::rp2350::kPanelWidth;
	if (height) *height = gea::rp2350::kPanelHeight;
	const int pixels = gea::rp2350::kPanelWidth * gea::rp2350::kPanelHeight;
	if (!dst || pixelCapacity < pixels || !gFramebuffer) return false;
	std::memcpy(dst, gFramebuffer, static_cast<std::size_t>(pixels) * sizeof(std::uint16_t));
	return true;
}
int Display::countNonBlackPixels(bool)
{
	if (!gFramebuffer) return 0;
	int count = 0;
	const int pixels = gea::rp2350::kPanelWidth * gea::rp2350::kPanelHeight;
	for (int i = 0; i < pixels; ++i) {
		if (gFramebuffer[i] != 0) ++count;
	}
	return count;
}

void Display::clear()
{
	gDisplayCanvas.clear(0);
	flush();
}
void Display::clearNoFlush() { gDisplayCanvas.clear(0); }
void Display::print(const char *) {}
void Display::flush()
{
	int x0 = 0;
	int y0 = 0;
	int x1 = -1;
	int y1 = -1;
	if (gInvalidated) {
		x0 = 0;
		y0 = 0;
		x1 = gea::rp2350::kPanelWidth - 1;
		y1 = gea::rp2350::kPanelHeight - 1;
		gInvalidated = false;
	} else if (!gDisplayCanvas.dirty(&x0, &y0, &x1, &y1)) {
		return;
	}
	flushRectClipped(x0, y0, x1, y1);
	gDisplayCanvas.resetDirty();
	gPreviousPresentValid = false;
}

void Display::flushRects(const DisplayFlushRect *rects, int count, bool)
{
	if (!rects || count <= 0) return;
	std::array<FlushWindow, kMaxCollectedWindows> windows{};
	const int mergedCount = collectFlushWindows(rects, count, windows);
	for (int i = 0; i < mergedCount; ++i) {
		const FlushWindow &window = windows[static_cast<std::size_t>(i)];
		flushRectClipped(window.x0, window.y0, window.x1, window.y1);
	}
	gDisplayCanvas.resetDirty();
	gInvalidated = false;
	gPreviousPresentValid = false;
}

void Display::flushRectsRasterized(const DisplayFlushRect *rects, int count, DisplayStreamRasterFn raster, void *user, bool)
{
	if (!rects || count <= 0 || !raster) return;
	std::array<FlushWindow, kMaxCollectedWindows> windows{};
	const int mergedCount = collectFlushWindows(rects, count, windows);
#if GEA_RP2350_PANEL_HW_VSCROLL
	if (gDisplayCanvas.scrollRegionH() > 0 && gScrollOffsetY != 0 && gFramebuffer) {
		// GRAM is circularly offset (panel scroll register engaged): the fused
		// stream would land at wrong rows. Raster row-by-row through the
		// framebuffer at its physical rows, then flush translated.
		for (int i = 0; i < mergedCount; ++i) {
			const FlushWindow &window = windows[static_cast<std::size_t>(i)];
			const int rowWidth = window.x1 - window.x0 + 1;
			std::uint16_t rowBuf[gea::rp2350::kPanelWidth];
			for (int yy = window.y0; yy <= window.y1; ++yy) {
				raster(rowBuf, rowWidth, 1, window.x0, yy, user);
				const int physY = gDisplayCanvas.rowToPhysical(yy);
				std::copy_n(rowBuf,
				            rowWidth,
				            gFramebuffer + static_cast<std::size_t>(physY) * gea::rp2350::kPanelWidth + window.x0);
			}
			flushRectClipped(window.x0, window.y0, window.x1, window.y1);
		}
		gDisplayCanvas.resetDirty();
		gInvalidated = false;
		gPreviousPresentValid = false;
		return;
	}
#endif
	for (int i = 0; i < mergedCount; ++i) {
		const FlushWindow &window = windows[static_cast<std::size_t>(i)];
		streamRect(window.x0,
		           window.y0,
		           window.x1 - window.x0 + 1,
		           window.y1 - window.y0 + 1,
		           raster,
		           user);
	}
	gDisplayCanvas.resetDirty();
	gInvalidated = false;
	gPreviousPresentValid = false;
}

void Display::rebindCanvasToFramebuffer()
{
	if (gFramebuffer) gDisplayCanvas.bindPixels(gFramebuffer, gea::rp2350::kPanelWidth, gea::rp2350::kPanelHeight);
#if GEA_RP2350_RENDER_CORE1
	if (gFramebuffer) gRenderWorkerCanvas.bindPixels(gFramebuffer, gea::rp2350::kPanelWidth, gea::rp2350::kPanelHeight);
#endif
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
	setScrollRegionAll(gScrollRegionY, gScrollRegionH, gScrollOffsetY);
#endif
}

bool Display::streamRect(int x, int y, int w, int h, DisplayStreamRasterFn raster, void *user)
{
	if (!raster || w <= 0 || h <= 0) return false;
#if GEA_RP2350_PANEL_HW_VSCROLL
	// GRAM rows are circularly offset while the panel scroll register is
	// engaged; a raster stream addressed at logical rows would land wrong.
	if (gDisplayCanvas.scrollRegionH() > 0 && gScrollOffsetY != 0) return false;
#endif
	int x0 = std::max(0, x);
	int y0 = std::max(0, y);
	int x1 = std::min(gea::rp2350::kPanelWidth - 1, x + w - 1);
	int y1 = std::min(gea::rp2350::kPanelHeight - 1, y + h - 1);
	if (x0 > x1 || y0 > y1) return true;
	gea::rp2350::panelStreamRect(x0, y0, x1, y1, raster, user);
	gPreviousPresentValid = false;
	return true;
}

bool Display::present(const DisplayPresentCommand *commands, int commandCount)
{
	if (!commands || commandCount <= 0) return false;
	if (presentDirectToPanel(commands, commandCount)) return true;
	gPreviousPresentValid = false;
	for (int i = 0; i < commandCount; ++i) {
		const auto &command = commands[i];
		switch (command.type) {
		case DisplayPresentCommandType::Clear:
			gDisplayCanvas.clear(command.clear.color);
			break;
		case DisplayPresentCommandType::FillRectRgb565:
			gDisplayCanvas.setGlobalAlpha(command.fillRectRgb565.alpha);
			gDisplayCanvas.fillRect(command.fillRectRgb565.x, command.fillRectRgb565.y,
			                        command.fillRectRgb565.w, command.fillRectRgb565.h,
			                        command.fillRectRgb565.color);
			break;
		case DisplayPresentCommandType::StrokeRectRgb565:
			gDisplayCanvas.setGlobalAlpha(command.strokeRectRgb565.alpha);
			gDisplayCanvas.strokeRect(command.strokeRectRgb565.x, command.strokeRectRgb565.y,
			                          command.strokeRectRgb565.w, command.strokeRectRgb565.h,
			                          command.strokeRectRgb565.color);
			break;
		case DisplayPresentCommandType::FillTriangleRgb565:
			gDisplayCanvas.setGlobalAlpha(command.fillTriangleRgb565.alpha);
			gDisplayCanvas.fillTriangle(command.fillTriangleRgb565.x0, command.fillTriangleRgb565.y0,
			                            command.fillTriangleRgb565.x1, command.fillTriangleRgb565.y1,
			                            command.fillTriangleRgb565.x2, command.fillTriangleRgb565.y2,
			                            command.fillTriangleRgb565.color);
			break;
		case DisplayPresentCommandType::FillCircleRgb565:
			gDisplayCanvas.setGlobalAlpha(command.fillCircleRgb565.alpha);
			gDisplayCanvas.fillCircle(command.fillCircleRgb565.x, command.fillCircleRgb565.y,
			                          command.fillCircleRgb565.radius, command.fillCircleRgb565.color);
			break;
		case DisplayPresentCommandType::StrokeCircleRgb565:
			gDisplayCanvas.setGlobalAlpha(command.strokeCircleRgb565.alpha);
			gDisplayCanvas.strokeCircle(command.strokeCircleRgb565.x, command.strokeCircleRgb565.y,
			                            command.strokeCircleRgb565.radius, command.strokeCircleRgb565.color);
			break;
			case DisplayPresentCommandType::FillCirclesRgb565:
				gDisplayCanvas.setGlobalAlpha(command.fillCirclesRgb565.alpha);
				gDisplayCanvas.fillCirclesRgb565(command.fillCirclesRgb565.xs, command.fillCirclesRgb565.ys,
				                                 command.fillCirclesRgb565.count, command.fillCirclesRgb565.radius,
				                                 command.fillCirclesRgb565.colors);
				break;
			case DisplayPresentCommandType::DrawImage:
				gDisplayCanvas.setGlobalAlpha(command.drawImage.alpha);
			gDisplayCanvas.drawImage(command.drawImage.pixels, command.drawImage.alphaPixels,
			                         command.drawImage.srcWidth, command.drawImage.srcHeight,
			                         command.drawImage.x, command.drawImage.y);
			break;
		case DisplayPresentCommandType::DrawImageScaled:
			gDisplayCanvas.setGlobalAlpha(command.drawImageScaled.alpha);
			gDisplayCanvas.drawImage(command.drawImageScaled.pixels, command.drawImageScaled.alphaPixels,
			                         command.drawImageScaled.srcWidth, command.drawImageScaled.srcHeight,
			                         command.drawImageScaled.x, command.drawImageScaled.y,
			                         command.drawImageScaled.w, command.drawImageScaled.h);
			break;
		case DisplayPresentCommandType::DrawImageRotated90CW:
			gDisplayCanvas.setGlobalAlpha(command.drawImageRotated90CW.alpha);
			gDisplayCanvas.drawImageRotated90CW(command.drawImageRotated90CW.pixels,
			                                    command.drawImageRotated90CW.alphaPixels,
			                                    command.drawImageRotated90CW.srcWidth,
			                                    command.drawImageRotated90CW.srcHeight,
			                                    command.drawImageRotated90CW.x,
			                                    command.drawImageRotated90CW.y,
			                                    command.drawImageRotated90CW.w,
			                                    command.drawImageRotated90CW.h);
			break;
		case DisplayPresentCommandType::DrawImageTiledX:
			gDisplayCanvas.setGlobalAlpha(command.drawImageTiledX.alpha);
			gDisplayCanvas.drawImageTiledX(command.drawImageTiledX.pixels, command.drawImageTiledX.alphaPixels,
			                               command.drawImageTiledX.srcWidth, command.drawImageTiledX.srcHeight,
			                               command.drawImageTiledX.x, command.drawImageTiledX.y,
			                               command.drawImageTiledX.w);
			break;
		case DisplayPresentCommandType::FillText:
			gDisplayCanvas.setGlobalAlpha(command.fillText.alpha);
			if (command.fillText.fontFamilyId >= 0) {
				gDisplayCanvas.drawTextFontFamily(command.fillText.text, command.fillText.x, command.fillText.y,
				                                  command.fillText.color, command.fillText.fontFamilyId,
				                                  command.fillText.fontSizePx);
			} else {
				gDisplayCanvas.drawText(command.fillText.text, command.fillText.x, command.fillText.y,
				                        command.fillText.color, command.fillText.scale);
			}
			break;
		}
	}
	gDisplayCanvas.setGlobalAlpha(gDisplayAlpha);
	flush();
	return true;
}

void Display::setFlushConfig(int chunkRows, int queueDepth)
{
	if (chunkRows > 0) gFlushRows = chunkRows;
	if (queueDepth > 0) gFlushDepth = queueDepth;
	gea::rp2350::panelSetFlushConfig(gFlushRows, gFlushDepth);
}
void Display::reserveInternal(std::size_t) {}
bool Display::setHighBrightnessMode(bool) { return false; }
bool Display::highBrightnessMode() { return false; }
void Display::applyPendingInternalReserve() {}
int Display::flushChunkRows() { return gFlushRows; }
int Display::flushQueueDepth() { return gFlushDepth; }
int Display::flushBufferBytes() { return gea::rp2350::kPanelWidth * gFlushRows * 2 * gFlushDepth; }
void Display::pushClip(int x, int y, int w, int h) { activeDisplayCanvas().pushClip(x, y, w, h); }
void Display::popClip() { activeDisplayCanvas().popClip(); }
void Display::resetClip() { activeDisplayCanvas().resetClip(); }
void Display::setAlpha(std::uint8_t alpha)
{
	activeDisplayCanvas().setGlobalAlpha(alpha);
	if (!onRenderWorkerCore()) gDisplayAlpha = alpha;
}
std::uint8_t Display::alpha() { return activeDisplayCanvas().globalAlpha(); }
int Display::brightness() { return gBrightness; }
void Display::setBrightness(int brightnessPercent)
{
	gBrightness = std::clamp(brightnessPercent, 0, 100);
	gea::rp2350::panelSetBrightness(gBrightness);
}
void Display::setVSync(bool on) { gVsyncDriven = on; }
bool Display::vsyncEnabled() { return gVsyncDriven; }
void Display::invalidate() { gInvalidated = true; }
void Display::setPresentScale(int scale) { gPresentScale = scale >= 2 ? 2 : 1; }
void Display::vsyncWaitForFrame() {}
void Display::clip(int *x0, int *y0, int *x1, int *y1) { activeDisplayCanvas().currentClip(x0, y0, x1, y1); }
void Display::fillRect(int x, int y, int w, int h, Pixel color) { activeDisplayCanvas().fillRect(x, y, w, h, color); }
void Display::scrollRect(int x, int y, int w, int h, int dx, int dy)
{
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
	if (!onRenderWorkerCore() &&
	    dx == 0 &&
	    dy != 0 &&
	    x == 0 &&
	    w >= gea::rp2350::kPanelWidth &&
	    h > 0 &&
	    y >= 0 &&
	    y + h <= gea::rp2350::kPanelHeight) {
		if (gScrollRegionY != y || gScrollRegionH != h) {
			gScrollRegionY = y;
			gScrollRegionH = h;
			gScrollOffsetY = 0;
		}
		gScrollOffsetY -= dy;
		gScrollOffsetY %= gScrollRegionH;
		if (gScrollOffsetY < 0) gScrollOffsetY += gScrollRegionH;
		setScrollRegionAll(gScrollRegionY, gScrollRegionH, gScrollOffsetY);
#if GEA_RP2350_PANEL_HW_VSCROLL
		if (gScrollRegionY == 0 && gScrollRegionH == gea::rp2350::kPanelHeight) {
			// The panel rotates scanout itself (VSCSAD in setScrollRegionAll);
			// only the revealed strip needs pixels, and its replay marks its
			// own dirty rect.
			return;
		}
#endif
		gDisplayCanvas.markDirty(0, y, gea::rp2350::kPanelWidth - 1, y + h - 1);
		return;
	}
#endif
	activeDisplayCanvas().scrollRect(x, y, w, h, dx, dy);
}
void Display::resetScrollRegion()
{
#if GEA_RP2350_SOFTWARE_SCROLL_REGISTER
	setScrollRegionAll(0, 0, 0);
#else
	activeDisplayCanvas().setScrollRegion(0, 0, 0);
#endif
}
void Display::strokeRect(int x, int y, int w, int h, Pixel color) { activeDisplayCanvas().strokeRect(x, y, w, h, color); }
void Display::fillCircle(int cx, int cy, int r, Pixel color) { activeDisplayCanvas().fillCircle(cx, cy, r, color); }
void Display::strokeCircle(int cx, int cy, int r, Pixel color) { activeDisplayCanvas().strokeCircle(cx, cy, r, color); }
void Display::drawLine(int x0, int y0, int x1, int y1, Pixel color) { activeDisplayCanvas().drawLine(x0, y0, x1, y1, color); }
void Display::drawArc(int cx, int cy, int r, int startDeg, int endDeg, Pixel color) { activeDisplayCanvas().drawArc(cx, cy, r, startDeg, endDeg, color); }
void Display::fillTriangle(int x0, int y0, int x1, int y1, int x2, int y2, Pixel color) { activeDisplayCanvas().fillTriangle(x0, y0, x1, y1, x2, y2, color); }
void Display::drawText(const char *text, int x, int y, Pixel color, float scale) { activeDisplayCanvas().drawText(text, x, y, color, scale); }
void Display::drawTextFont(const char *text, int x, int y, Pixel color, int fontId) { activeDisplayCanvas().drawTextFont(text, x, y, color, fontId); }
void Display::drawTextFontFamily(const char *text, int x, int y, Pixel color, int familyId, int sizePx) { activeDisplayCanvas().drawTextFontFamily(text, x, y, color, familyId, sizePx); }
void Display::setPixel(int x, int y, Pixel color) { activeDisplayCanvas().fillRect(x, y, 1, 1, color); }
void Display::fillRoundedRect(int x, int y, int w, int h, int tl, int tr, int br, int bl, Pixel color) { activeDisplayCanvas().fillRoundedRect(x, y, w, h, tl, tr, br, bl, color); }
void Display::fillRoundedRectBoxesRgb565(const std::int16_t *xs, const std::int16_t *ys, int count, int w, int h, int tl, int tr, int br, int bl, const Pixel *colors)
{
	activeDisplayCanvas().fillRoundedRectBoxesRgb565(xs, ys, count, w, h, tl, tr, br, bl, colors);
}
void Display::strokeRoundedRect(int x, int y, int w, int h, int tl, int tr, int br, int bl, int lw, Pixel color) { activeDisplayCanvas().strokeRoundedRect(x, y, w, h, tl, tr, br, bl, lw, color); }
void Display::blitImage(const Pixel *src, const std::uint8_t *alpha, int srcW, int srcH, int dx, int dy) { activeDisplayCanvas().drawImage(src, alpha, srcW, srcH, dx, dy); }
void Display::blitImageScaled(const Pixel *src, const std::uint8_t *alpha, int srcW, int srcH, int dx, int dy, int dstW, int dstH) { activeDisplayCanvas().drawImage(src, alpha, srcW, srcH, dx, dy, dstW, dstH); }
void Display::setWorldOverlay(const std::uint16_t *, int, int, int, int) {}
void Display::setWorldScroll(int) {}
void Display::flushStatsRead(std::int64_t *totalUs, int *callCount, int *pixelCount)
{
	const auto stats = gea::rp2350::panelFlushStatsRead();
	if (totalUs) *totalUs = stats.totalUs;
	if (callCount) *callCount = stats.callCount;
	if (pixelCount) *pixelCount = stats.pixelCount;
}
DisplayFlushPerfStats Display::flushPerfStatsRead()
{
	const auto panelStats = gea::rp2350::panelFlushStatsRead();
	DisplayFlushPerfStats stats{};
	stats.totalUs = panelStats.totalUs;
	stats.setWindowUs = panelStats.setWindowUs;
	stats.copyUs = panelStats.copyUs;
	stats.txUs = panelStats.txWaitUs;
	stats.completeWaitUs = panelStats.txWaitUs;
	stats.callCount = panelStats.callCount;
	stats.chunkCount = panelStats.chunkCount;
	stats.pixelCount = panelStats.pixelCount;
	return stats;
}
void Display::presentPathDebug(int *calls, int *direct, int *general, int *rejected, int *tileShapeFailKind, int *tileShapeFailType, int *tileShapeFailCount)
{
	if (calls) *calls = 0;
	if (direct) *direct = 0;
	if (general) *general = 0;
	if (rejected) *rejected = 0;
	if (tileShapeFailKind) *tileShapeFailKind = 0;
	if (tileShapeFailType) *tileShapeFailType = 0;
	if (tileShapeFailCount) *tileShapeFailCount = 0;
}
void Display::landFrameDebug(int *total, int *align, int *raster, int *text, int *flip)
{
	if (total) *total = 0;
	if (align) *align = 0;
	if (raster) *raster = 0;
	if (text) *text = 0;
	if (flip) *flip = 0;
}
void Display::landPanDebug(int *detect, int *kick, int *strips, int *wait, int *interior)
{
	if (detect) *detect = 0;
	if (kick) *kick = 0;
	if (strips) *strips = 0;
	if (wait) *wait = 0;
	if (interior) *interior = 0;
}
void Display::flushStatsReset()
{
	gFlushCalls = 0;
	gFlushPixels = 0;
	gea::rp2350::panelFlushStatsReset();
}
const char *Display::flushStageName() { return "idle"; }
int Display::flushStageChunk() { return 0; }
DisplayFlushStageDetail Display::flushStageDetail() { return {}; }

}  // namespace gea::platform::display

namespace gea::framework::display {

