geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
double DisplayBackend::brightness() { return static_cast<double>(gea::platform::display::Display::brightness()); }
void DisplayBackend::setBrightness(double brightness) { gea::platform::display::Display::setBrightness(static_cast<int>(brightness)); }
void DisplayBackend::setAA(double samples) { gea::platform::display::Display::setAA(static_cast<int>(samples)); }
void DisplayBackend::setFlushConfig(double rows, double depth) { gea::platform::display::Display::setFlushConfig(static_cast<int>(rows), static_cast<int>(depth)); }
void DisplayBackend::setEpaperRefreshConfig(double, double, double, const std::vector<std::uint8_t> &, bool, const std::vector<std::uint8_t> &, bool) {}
void DisplayBackend::epaperFullRefresh() {}
void DisplayBackend::setEpaperGrayscale(bool) {}
double DisplayBackend::nativeWidth() { return static_cast<double>(detail::DisplayOrientationState::nativeWidth()); }
double DisplayBackend::nativeHeight() { return static_cast<double>(detail::DisplayOrientationState::nativeHeight()); }
std::string DisplayBackend::orientation() { return detail::DisplayOrientationState::orientationString(); }
void DisplayBackend::setOrientation(const std::string &orientation) { detail::DisplayOrientationState::setOrientation(orientation); }
std::vector<std::string> DisplayBackend::supportedOrientations() { return detail::DisplayOrientationState::supportedOrientations(); }
void DisplayBackend::setSupportedOrientations(const std::vector<std::string> &orientations) { detail::DisplayOrientationState::setSupportedOrientations(orientations); }
void DisplayBackend::setSupportedOrientations(const std::string &orientation) { detail::DisplayOrientationState::setSupportedOrientations(orientation); }
bool DisplayBackend::autoRotate() { return detail::DisplayOrientationState::autoRotate(); }
void DisplayBackend::setAutoRotate(bool enabled) { detail::DisplayOrientationState::setAutoRotate(enabled); }
void DisplayBackend::setVSync(bool on) { gea::platform::display::Display::setVSync(on); }
void DisplayBackend::setTextRasterCache(bool on) { gea::framework::graphics::Canvas::setTextRasterCacheEnabled(on); }
void DisplayBackend::invalidate() { gea::platform::display::Display::invalidate(); }
std::string DisplayBackend::pixelFormat() { return "rgb565"; }
void DisplayBackend::setPixelFormat(const std::string &) {}
std::string DisplayBackend::panelPixelFormat() { return "rgb565"; }
std::vector<std::string> DisplayBackend::supportedPixelFormats() { return {"rgb565"}; }
void DisplayBackend::updateAutoRotationFromAccelerometer() { detail::DisplayOrientationState::updateAutoRotationFromAccelerometer(); }
void DisplayBackend::updateAutoRotation(double x, double y, double z) { detail::DisplayOrientationState::updateAutoRotation(x, y, z); }

}  // namespace gea::framework::display

namespace gea::platform::touch {

void Touchscreen::setObserver(Observer observer)
{
#if GEA_RP2350_HAS_TOUCH
	gTouchObserver = observer;
#else
	(void)observer;
#endif
}

bool Touchscreen::init()
{
#if GEA_RP2350_HAS_TOUCH
	gpio_init(board::touch.reset);
	gpio_set_dir(board::touch.reset, GPIO_OUT);
	gpio_put(board::touch.reset, 1);
	sleep_ms(10);
	gpio_put(board::touch.reset, 0);
	sleep_ms(10);
	gpio_put(board::touch.reset, 1);
	sleep_ms(300);

	gpio_init(board::touch.interrupt);
	gpio_set_dir(board::touch.interrupt, GPIO_IN);
	gpio_pull_up(board::touch.interrupt);

	std::uint8_t chipId = 0;
	const bool idOk = gTouchCore.readChipId(gTouchBus, chipId);
	gTouchInitialized = idOk && chipId == gea::chips::ft6336::kExpectedChipId &&
	                    gTouchCore.configure(gTouchBus, false);
	std::printf("ft6336 init=%d id_ok=%d id=0x%02x\n",
	            gTouchInitialized ? 1 : 0,
	            idOk ? 1 : 0,
	            chipId);
	return gTouchInitialized;
#else
	return false;
#endif
}

int Touchscreen::read(int *x, int *y)
{
#if GEA_RP2350_HAS_TOUCH
	gea::chips::ft6336::TouchSample sample{};
	const bool ok = gTouchCore.read(gTouchBus, sample);
	if (ok && sample.touching) {
		gTouchX = std::clamp(sample.x, 0, gea::rp2350::kPanelWidth - 1);
		gTouchY = std::clamp(sample.y, 0, gea::rp2350::kPanelHeight - 1);
		gTouching = true;
		if (x) *x = gTouchX;
		if (y) *y = gTouchY;
		return 1;
	}
	if (x) *x = gTouchX;
	if (y) *y = gTouchY;
	return 0;
#else
	if (x) *x = 0;
	if (y) *y = 0;
	return 0;
#endif
}

int Touchscreen::readCached(int *x, int *y)
{
#if GEA_RP2350_HAS_TOUCH
	if (x) *x = gTouchX;
	if (y) *y = gTouchY;
	return gTouching ? 1 : 0;
#else
	if (x) *x = 0;
	if (y) *y = 0;
	return 0;
#endif
}

void Touchscreen::consumeLatestMove(int *x, int *y)
{
#if GEA_RP2350_HAS_TOUCH
	if (x) *x = gTouchX;
	if (y) *y = gTouchY;
#else
	if (x) *x = 0;
	if (y) *y = 0;
#endif
}

void Touchscreen::injectEvent(Phase phase, bool touching, int x, int y)
{
#if GEA_RP2350_HAS_TOUCH
	gTouchX = x;
	gTouchY = y;
	gTouching = touching;
	if (gTouchObserver) gTouchObserver(phase, touching, x, y);
#else
	(void)phase;
	(void)touching;
	(void)x;
	(void)y;
#endif
}

}  // namespace gea::platform::touch

namespace gea::framework::sensors {
void AccelerometerBackend::init() {}
void AccelerometerBackend::close() {}
void AccelerometerBackend::calibrateBias() {}
double AccelerometerBackend::tiltX() { return 0.0; }
double AccelerometerBackend::tiltY() { return 0.0; }
double AccelerometerBackend::accelerationX() { return 0.0; }
double AccelerometerBackend::accelerationY() { return 0.0; }
double AccelerometerBackend::accelerationZ() { return 9.8; }
double AccelerometerBackend::gyroscopeX() { return 0.0; }
double AccelerometerBackend::gyroscopeY() { return 0.0; }
double AccelerometerBackend::gyroscopeZ() { return 0.0; }
}  // namespace gea::framework::sensors

namespace gea::framework::network {
bool WifiBackend::enabled() { return false; }
void WifiBackend::setEnabled(bool) {}
bool WifiBackend::connected() { return false; }
double WifiBackend::rssi() { return 0.0; }
std::string WifiBackend::ssid() { return {}; }
std::string WifiBackend::ip() { return {}; }
std::string WifiBackend::mac() { return {}; }
void WifiBackend::configure(const std::string &, const std::string &) {}
bool WifiBackend::waitForConnection(double) { return false; }
void WifiBackend::startScan() {}
bool WifiBackend::scanning() { return false; }
double WifiBackend::scanCount() { return 0.0; }
std::string WifiBackend::scanSsidAt(double) { return {}; }
double WifiBackend::scanRssiAt(double) { return 0.0; }
bool WifiBackend::scanSecuredAt(double) { return false; }
}  // namespace gea::framework::network

