geastack/targets/targets/rp2350-waveshare-touch-amoled-2.41/main/rp2350_gea_platform.cpp
namespace gea::framework::camera {
bool CameraBackend::isAvailable() { return false; }
bool CameraBackend::hasPermission() { return false; }
bool CameraBackend::requestPermission() { return false; }
bool CameraBackend::open(const std::string &, double, double) { return false; }
void CameraBackend::close() {}
bool CameraBackend::isOpen() { return false; }
double CameraBackend::width() { return 0.0; }
double CameraBackend::height() { return 0.0; }
double CameraBackend::orientation() { return 0.0; }
std::string CameraBackend::facing() { return {}; }
double CameraBackend::deviceCount() { return 0.0; }
std::string CameraBackend::deviceIdAt(double) { return {}; }
std::string CameraBackend::deviceFacingAt(double) { return {}; }
void CameraBackend::draw(double, double, double, double) {}
double CameraBackend::capture() { return -1.0; }
double CameraBackend::captureMirrored() { return -1.0; }
bool CameraBackend::startRecording(const std::string &, double) { return false; }
double CameraBackend::stopRecording() { return -1.0; }
bool CameraBackend::isRecording() { return false; }
void CameraBackend::setFlash(const std::string &) {}
void CameraBackend::setZoom(double) {}
void CameraBackend::setMirror(bool) {}
void CameraBackend::setExposure(const std::string &, double, double, double) {}
void CameraBackend::setWhiteBalance(const std::string &, double, double) {}
void CameraBackend::setFocus(const std::string &, double, double) {}
void CameraBackend::setTorch(const std::string &, double) {}
void registerCameraSurface() {}
}  // namespace gea::framework::camera

namespace gea::framework::geolocation {
bool GeolocationBackend::hasFix() { return false; }
GeolocationPosition GeolocationBackend::currentPosition() { return {}; }
double GeolocationBackend::latitude() { return 0.0; }
double GeolocationBackend::longitude() { return 0.0; }
double GeolocationBackend::accuracy() { return -1.0; }
}  // namespace gea::framework::geolocation

namespace gea::framework::bluetooth {
void HidBackend::init(const std::string &, double, const std::string &) {}
bool HidBackend::enabled() { return false; }
void HidBackend::setEnabled(bool) {}
void HidBackend::startAdvertising() {}
void HidBackend::stopAdvertising() {}
bool HidBackend::connected() { return false; }
bool HidBackend::bound() { return false; }
double HidBackend::batteryLevel() { return 0.0; }
std::string HidBackend::mac() { return {}; }
std::string HidBackend::deviceName() { return {}; }
void HidBackend::keyTap(double) {}
void HidBackend::keyDown(double, double) {}
void HidBackend::keyUp() {}
void HidBackend::mouseMove(double, double, double, double) {}
void HidBackend::mouseClick(double) {}
}  // namespace gea::framework::bluetooth

namespace gea::framework::audio {
double AudioBackend::volume() { return 0.0; }
void AudioBackend::setVolume(double) {}
}  // namespace gea::framework::audio

namespace gea::framework::input {
bool InputBackend::consumeBackButton() { return false; }
}  // namespace gea::framework::input

namespace gea::platform::audio {
AudioParam::AudioParam(NativeAudioHandle oscillator) : oscillator_(oscillator) {}
double AudioParam::value() const { return 0.0; }
void AudioParam::setValue(double) {}
void AudioParam::setValueAtTime(double, double) {}
AudioNode::AudioNode(NativeAudioHandle native) : native_(native) {}
NativeAudioHandle AudioNode::nativeId() const { return native_; }
AudioDestinationNode::AudioDestinationNode(NativeAudioHandle native) : AudioNode(native) {}
OscillatorNode::OscillatorNode(NativeAudioHandle native) : AudioNode(native), frequency(native) {}
OscillatorType OscillatorNode::type() const { return OscillatorType::Sine; }
void OscillatorNode::setType(OscillatorType) {}
void OscillatorNode::connect(const AudioDestinationNode &) {}
void OscillatorNode::start(double) {}
void OscillatorNode::stop(double) {}
double AudioContext::currentTime() const { return 0.0; }
AudioDestinationNode AudioContext::destination() const { return AudioDestinationNode(); }
OscillatorNode AudioContext::createOscillator() const { return OscillatorNode(); }
AudioContext AudioSystem::sharedContext() { return AudioContext(); }
int AudioSystem::volume() { return 0; }
void AudioSystem::setVolume(int) {}
bool AudioSystem::playFile(const std::string &) { return false; }
bool AudioSystem::playPcm(const std::int16_t *, std::size_t, int, int) { return false; }
void AudioSystem::stopPlayback() {}
}  // namespace gea::platform::audio
